[Killed] BlockStatement
src/equations.ts:8:24
 export class Equation {
     constructor ( protected coefficients:Matrix ){}
 
-    evaluate(l:Matrix) {
-        let dims = this.coefficients.dimensions()
-        if (l.dimensions().lines !== dims.lines && l.dimensions().columns !==1){
-            throw new Error("Not enough parameter to evaluate")
-        }
-
-        let somme = new Float(0)
-        for (let i = 0; i < dims.lines; i++) {
-            let temp = new Float(1)
-            for (let j = 0; j < dims.columns; j++) {
-                let a = Float.multiply( this.coefficients.get(i,j),temp )
-                somme = Float.add( somme, a )
-                temp = Float.multiply(temp,l.get(i,0))
-
-            }
-        }
-
-        return somme
-    }
+    evaluate(l:Matrix) {}
 
     // retrieveXFromP2(y:number){
killedBy: Eq retrieve y
statusReason: expected undefined to strictly equal Float{ numerateur: -31, …(1) }

[Killed] ConditionalExpression
src/equations.ts:10:13
 
     evaluate(l:Matrix) {
         let dims = this.coefficients.dimensions()
-        if (l.dimensions().lines !== dims.lines && l.dimensions().columns !==1){
+        if (true){
             throw new Error("Not enough parameter to evaluate")
         }
killedBy: Eq retrieve y
statusReason: Not enough parameter to evaluate

[Survived] LogicalOperator
src/equations.ts:10:13
 
     evaluate(l:Matrix) {
         let dims = this.coefficients.dimensions()
-        if (l.dimensions().lines !== dims.lines && l.dimensions().columns !==1){
+        if (l.dimensions().lines !== dims.lines || l.dimensions().columns !== 1){
             throw new Error("Not enough parameter to evaluate")
         }

[Killed] EqualityOperator
src/equations.ts:15:25
         }
 
         let somme = new Float(0)
-        for (let i = 0; i < dims.lines; i++) {
+        for (let i = 0; i >= dims.lines; i++) {
             let temp = new Float(1)
             for (let j = 0; j < dims.columns; j++) {
killedBy: Eq retrieve y
statusReason: expected { Object (numerateur, denominateur) } to strictly equal Float{ numerateur: -31, …(1) }

[Killed] EqualityOperator
src/equations.ts:15:25
         }
 
         let somme = new Float(0)
-        for (let i = 0; i < dims.lines; i++) {
+        for (let i = 0; i <= dims.lines; i++) {
             let temp = new Float(1)
             for (let j = 0; j < dims.columns; j++) {
killedBy: Eq retrieve y
statusReason: Out of bounds 1 0 {1, 3}

[Killed] EqualityOperator
src/equations.ts:17:29
         let somme = new Float(0)
         for (let i = 0; i < dims.lines; i++) {
             let temp = new Float(1)
-            for (let j = 0; j < dims.columns; j++) {
+            for (let j = 0; j >= dims.columns; j++) {
                 let a = Float.multiply( this.coefficients.get(i,j),temp )
                 somme = Float.add( somme, a )
killedBy: Eq retrieve y
statusReason: expected { Object (numerateur, denominateur) } to strictly equal Float{ numerateur: -31, …(1) }

[Killed] EqualityOperator
src/equations.ts:17:29
         let somme = new Float(0)
         for (let i = 0; i < dims.lines; i++) {
             let temp = new Float(1)
-            for (let j = 0; j < dims.columns; j++) {
+            for (let j = 0; j <= dims.columns; j++) {
                 let a = Float.multiply( this.coefficients.get(i,j),temp )
                 somme = Float.add( somme, a )
killedBy: Eq retrieve y
statusReason: Out of bounds 0 3 {1, 3}
