[Survived] BlockStatement
src/fft.ts:8:27
 
     private tab : Complex[]
 
-    constructor (n:number){
-        this.tab = (new Array<Complex>(n)).fill(new Complex(new Float(0)))
-    }
+    constructor (n:number){}
 
     load (x:Float[]){

[Killed] BlockStatement
src/fft.ts:12:21
         this.tab = (new Array<Complex>(n)).fill(new Complex(new Float(0)))
     }
 
-    load (x:Float[]){
-        if (x.length > this.tab.length){
-            throw new Error("le tableau à charger doit être plus petit ou égal à la taille du tableau Complex")
-        }
-
-        for (let i = 0 ; i < x.length ; i++){
-            this.tab[i] = new Complex(x[i])
-        }
-    }
+    load (x:Float[]){}
 
     toString(){
killedBy: CpxTab
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] ConditionalExpression
src/fft.ts:13:13
     }
 
     load (x:Float[]){
-        if (x.length > this.tab.length){
+        if (false){
             throw new Error("le tableau à charger doit être plus petit ou égal à la taille du tableau Complex")
         }
killedBy: CpxTab plus petit
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/fft.ts:13:40
     }
 
     load (x:Float[]){
-        if (x.length > this.tab.length){
-            throw new Error("le tableau à charger doit être plus petit ou égal à la taille du tableau Complex")
-        }
+        if (x.length > this.tab.length){}
 
         for (let i = 0 ; i < x.length ; i++){
killedBy: CpxTab plus petit
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/fft.ts:17:26
             throw new Error("le tableau à charger doit être plus petit ou égal à la taille du tableau Complex")
         }
 
-        for (let i = 0 ; i < x.length ; i++){
+        for (let i = 0 ; i >= x.length ; i++){
             this.tab[i] = new Complex(x[i])
         }
killedBy: CpxTab
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] BlockStatement
src/fft.ts:17:45
             throw new Error("le tableau à charger doit être plus petit ou égal à la taille du tableau Complex")
         }
 
-        for (let i = 0 ; i < x.length ; i++){
-            this.tab[i] = new Complex(x[i])
-        }
+        for (let i = 0 ; i < x.length ; i++){}
     }
 
killedBy: CpxTab
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] BlockStatement
src/fft.ts:22:15
         }
     }
 
-    toString(){
-        return `[ ${this.tab.join(" ")} ]` 
-    }
+    toString(){}
 
     get(i:number) {
killedBy: CpxTab
statusReason: expected undefined to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] StringLiteral
src/fft.ts:23:35
     }
 
     toString(){
-        return `[ ${this.tab.join(" ")} ]` 
+        return `[ ${this.tab.join("")} ]` 
     }
 
killedBy: CpxTab
statusReason: expected '[ 1234 ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] StringLiteral
src/fft.ts:23:16
     }
 
     toString(){
-        return `[ ${this.tab.join(" ")} ]` 
+        return `` 
     }
 
killedBy: CpxTab
statusReason: expected '' to be '[ 1 2 3 4 ]' // Object.is equality

[Survived] BlockStatement
src/fft.ts:26:19
         return `[ ${this.tab.join(" ")} ]` 
     }
 
-    get(i:number) {
-        return this.tab[i]
-    }
+    get(i:number) {}
 
     set(i:number,c:Complex) {

[Killed] BlockStatement
src/fft.ts:30:29
         return this.tab[i]
     }
 
-    set(i:number,c:Complex) {
-        this.tab[i] = c
-    }
+    set(i:number,c:Complex) {}
 
     taille() {
killedBy: CpxTab
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 4 9 16 ]' // Object.is equality

[Survived] BlockStatement
src/fft.ts:34:14
         this.tab[i] = c
     }
 
-    taille() {
-        return this.tab.length
-    }
+    taille() {}
 
     conjugue() {

[Survived] BlockStatement
src/fft.ts:38:16
         return this.tab.length
     }
 
-    conjugue() {
-        let newTab = new CpxTab(this.taille())
-        for (let i = 0 ; i < this.taille() ; i++){
-            newTab.set(i,this.get(i).conjugue) 
-        }
-        return newTab
-    }
+    conjugue() {}
 
     static multiply(c1: CpxTab, c2 : CpxTab) {

[Killed] BlockStatement
src/fft.ts:40:50
 
     conjugue() {
         let newTab = new CpxTab(this.taille())
-        for (let i = 0 ; i < this.taille() ; i++){
-            newTab.set(i,this.get(i).conjugue) 
-        }
+        for (let i = 0 ; i < this.taille() ; i++){}
         return newTab
     }
killedBy: ifft
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] ConditionalExpression
src/fft.ts:40:26
 
     conjugue() {
         let newTab = new CpxTab(this.taille())
-        for (let i = 0 ; i < this.taille() ; i++){
+        for (let i = 0 ; false ; i++){
             newTab.set(i,this.get(i).conjugue) 
         }
killedBy: ifft
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] BlockStatement
src/fft.ts:46:46
         return newTab
     }
 
-    static multiply(c1: CpxTab, c2 : CpxTab) {
-        let newTab = new CpxTab(c1.taille())
-        for (let i = 0 ; i < c1.taille() ; i++){
-            newTab.set(i,Complex.multiply( c1.get(i), c2.get(i) ))
-        }
-        return newTab
-    }
+    static multiply(c1: CpxTab, c2 : CpxTab) {}
 }
 
killedBy: CpxTab
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] EqualityOperator
src/fft.ts:48:26
 
     static multiply(c1: CpxTab, c2 : CpxTab) {
         let newTab = new CpxTab(c1.taille())
-        for (let i = 0 ; i < c1.taille() ; i++){
+        for (let i = 0 ; i >= c1.taille() ; i++){
             newTab.set(i,Complex.multiply( c1.get(i), c2.get(i) ))
         }
killedBy: CpxTab
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 4 9 16 ]' // Object.is equality

[Killed] BlockStatement
src/fft.ts:48:48
 
     static multiply(c1: CpxTab, c2 : CpxTab) {
         let newTab = new CpxTab(c1.taille())
-        for (let i = 0 ; i < c1.taille() ; i++){
-            newTab.set(i,Complex.multiply( c1.get(i), c2.get(i) ))
-        }
+        for (let i = 0 ; i < c1.taille() ; i++){}
         return newTab
     }
killedBy: CpxTab
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 4 9 16 ]' // Object.is equality

[Survived] BlockStatement
src/fft.ts:55:65
     }
 }
 
-export function fftCombine(c1 : CpxTab , c2 : CpxTab ) : CpxTab {
-
-    if (c1.taille() != c2.taille()){
-        throw new Error(`combine: c1 et c2 ne sont pas de même taille, taille c1=${c1.taille()} taille c2=${c2.taille()}`)
-    }
-
-    let m = c1.taille();
-    let n = m*2;
-
-    let retour = new CpxTab(m*2);
-
-    for (let k = 0; k < m; k++){
-
-        let Wnr = Math.cos( 2 * Math.PI / n * k )
-        let Wni = Math.sin( 2 * Math.PI / n * k )
-
-        let Wn = new Complex(new Float(Wnr),new Float(Wni))
-
-        let a2 = Complex.multiply(Wn,c2.get(k))
-
-        retour.set(k, Complex.add(c1.get(k),a2))
-        retour.set(k+m, Complex.substract(c1.get(k),a2))
-    }
-    return retour;
-}
+export function fftCombine(c1 : CpxTab , c2 : CpxTab ) : CpxTab {}
 
 export function  fft(x:CpxTab) : CpxTab {

[Survived] EqualityOperator
src/fft.ts:57:9
 
 export function fftCombine(c1 : CpxTab , c2 : CpxTab ) : CpxTab {
 
-    if (c1.taille() != c2.taille()){
+    if (c1.taille() == c2.taille()){
         throw new Error(`combine: c1 et c2 ne sont pas de même taille, taille c1=${c1.taille()} taille c2=${c2.taille()}`)
     }

[NoCoverage] BlockStatement
src/fft.ts:57:36
 
 export function fftCombine(c1 : CpxTab , c2 : CpxTab ) : CpxTab {
 
-    if (c1.taille() != c2.taille()){
-        throw new Error(`combine: c1 et c2 ne sont pas de même taille, taille c1=${c1.taille()} taille c2=${c2.taille()}`)
-    }
+    if (c1.taille() != c2.taille()){}
 
     let m = c1.taille();

[NoCoverage] StringLiteral
src/fft.ts:58:25
 export function fftCombine(c1 : CpxTab , c2 : CpxTab ) : CpxTab {
 
     if (c1.taille() != c2.taille()){
-        throw new Error(`combine: c1 et c2 ne sont pas de même taille, taille c1=${c1.taille()} taille c2=${c2.taille()}`)
+        throw new Error(``)
     }
 

[Killed] ArithmeticOperator
src/fft.ts:62:13
     }
 
     let m = c1.taille();
-    let n = m*2;
+    let n = m / 2;
 
     let retour = new CpxTab(m*2);
killedBy: fft
statusReason: expected '[ 10 -4 -2 0 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Survived] ArithmeticOperator
src/fft.ts:64:29
     let m = c1.taille();
     let n = m*2;
 
-    let retour = new CpxTab(m*2);
+    let retour = new CpxTab(m / 2);
 
     for (let k = 0; k < m; k++){

[Killed] BlockStatement
src/fft.ts:66:32
 
     let retour = new CpxTab(m*2);
 
-    for (let k = 0; k < m; k++){
-
-        let Wnr = Math.cos( 2 * Math.PI / n * k )
-        let Wni = Math.sin( 2 * Math.PI / n * k )
-
-        let Wn = new Complex(new Float(Wnr),new Float(Wni))
-
-        let a2 = Complex.multiply(Wn,c2.get(k))
-
-        retour.set(k, Complex.add(c1.get(k),a2))
-        retour.set(k+m, Complex.substract(c1.get(k),a2))
-    }
+    for (let k = 0; k < m; k++){}
     return retour;
 }
killedBy: fft
statusReason: expected '[ 0 0 0 0 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ConditionalExpression
src/fft.ts:66:21
 
     let retour = new CpxTab(m*2);
 
-    for (let k = 0; k < m; k++){
+    for (let k = 0; false; k++){
 
         let Wnr = Math.cos( 2 * Math.PI / n * k )
killedBy: fft
statusReason: expected '[ 0 0 0 0 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ArithmeticOperator
src/fft.ts:68:29
 
     for (let k = 0; k < m; k++){
 
-        let Wnr = Math.cos( 2 * Math.PI / n * k )
+        let Wnr = Math.cos( 2 / Math.PI / n * k )
         let Wni = Math.sin( 2 * Math.PI / n * k )
 
killedBy: fft
statusReason: expected '[ 10 -3.9747-2i -2 -0.0253+2i ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ArithmeticOperator
src/fft.ts:68:29
 
     for (let k = 0; k < m; k++){
 
-        let Wnr = Math.cos( 2 * Math.PI / n * k )
+        let Wnr = Math.cos( 2 * Math.PI * n * k )
         let Wni = Math.sin( 2 * Math.PI / n * k )
 
killedBy: fft
statusReason: expected '[ 10 -4-2i -2 2i ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ArithmeticOperator
src/fft.ts:69:29
     for (let k = 0; k < m; k++){
 
         let Wnr = Math.cos( 2 * Math.PI / n * k )
-        let Wni = Math.sin( 2 * Math.PI / n * k )
+        let Wni = Math.sin( 2 * Math.PI * n * k )
 
         let Wn = new Complex(new Float(Wnr),new Float(Wni))
killedBy: fft
statusReason: expected '[ 10 -2 -2 -2 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ArithmeticOperator
src/fft.ts:69:29
     for (let k = 0; k < m; k++){
 
         let Wnr = Math.cos( 2 * Math.PI / n * k )
-        let Wni = Math.sin( 2 * Math.PI / n * k )
+        let Wni = Math.sin( 2 / Math.PI / n * k )
 
         let Wn = new Complex(new Float(Wnr),new Float(Wni))
killedBy: fft
statusReason: expected '[ 10 -2-0.317i -2 -2+0.317i ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ArithmeticOperator
src/fft.ts:76:20
         let a2 = Complex.multiply(Wn,c2.get(k))
 
         retour.set(k, Complex.add(c1.get(k),a2))
-        retour.set(k+m, Complex.substract(c1.get(k),a2))
+        retour.set(k - m, Complex.substract(c1.get(k),a2))
     }
     return retour;
killedBy: fft
statusReason: expected '[ 10 0 0 0 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Survived] BlockStatement
src/fft.ts:81:41
     return retour;
 }
 
-export function  fft(x:CpxTab) : CpxTab {
-    let n = x.taille();
-
-    if (n==1){return x;}
-    else if (n % 2 !== 0){
-        throw new Error(`FFT: la taille de x doit être une puissance de 2`)
-    }
-
-    let Apair = new CpxTab(n/2);
-    let Aimpair = new CpxTab(n/2);
-
-    // partie pair
-    for ( let i = 0; i < n ; i+=2 ){
-        Apair.set(i/2, x.get(i))
-    }
-    // partie impair
-    for ( let i = 1; i < n ; i+=2 ){
-        Aimpair.set((i-1)/2, x.get(i))
-    }
-
-    let yPair = fft(Apair);
-    let yImpair = fft(Aimpair);
-
-    return fftCombine(yPair,yImpair);
-}
+export function  fft(x:CpxTab) : CpxTab {}
         
 export function  ifft(y:CpxTab) : CpxTab {

[Killed] ConditionalExpression
src/fft.ts:84:9
 export function  fft(x:CpxTab) : CpxTab {
     let n = x.taille();
 
-    if (n==1){return x;}
+    if (true){return x;}
     else if (n % 2 !== 0){
         throw new Error(`FFT: la taille de x doit être une puissance de 2`)
killedBy: fft
statusReason: expected '[ 1 2 3 4 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] EqualityOperator
src/fft.ts:84:9
 export function  fft(x:CpxTab) : CpxTab {
     let n = x.taille();
 
-    if (n==1){return x;}
+    if (n != 1){return x;}
     else if (n % 2 !== 0){
         throw new Error(`FFT: la taille de x doit être une puissance de 2`)
killedBy: fft
statusReason: expected '[ 1 2 3 4 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ConditionalExpression
src/fft.ts:85:14
     let n = x.taille();
 
     if (n==1){return x;}
-    else if (n % 2 !== 0){
+    else if (false){
         throw new Error(`FFT: la taille de x doit être une puissance de 2`)
     }
killedBy: FFT tableau de taille 2**n
statusReason: expected [Function] to throw error including 'FFT: la taille de x doit être une pui…' but got 'Invalid array length'

[Killed] BlockStatement
src/fft.ts:85:26
     let n = x.taille();
 
     if (n==1){return x;}
-    else if (n % 2 !== 0){
-        throw new Error(`FFT: la taille de x doit être une puissance de 2`)
-    }
+    else if (n % 2 !== 0){}
 
     let Apair = new CpxTab(n/2);
killedBy: FFT tableau de taille 2**n
statusReason: expected [Function] to throw error including 'FFT: la taille de x doit être une pui…' but got 'Invalid array length'

[Timeout] ArithmeticOperator
src/fft.ts:89:28
         throw new Error(`FFT: la taille de x doit être une puissance de 2`)
     }
 
-    let Apair = new CpxTab(n/2);
+    let Apair = new CpxTab(n * 2);
     let Aimpair = new CpxTab(n/2);
 

[Survived] ArithmeticOperator
src/fft.ts:90:30
     }
 
     let Apair = new CpxTab(n/2);
-    let Aimpair = new CpxTab(n/2);
+    let Aimpair = new CpxTab(n * 2);
 
     // partie pair

[Killed] EqualityOperator
src/fft.ts:93:22
     let Aimpair = new CpxTab(n/2);
 
     // partie pair
-    for ( let i = 0; i < n ; i+=2 ){
+    for ( let i = 0; i >= n ; i+=2 ){
         Apair.set(i/2, x.get(i))
     }
killedBy: fft
statusReason: expected '[ 4 -4i -4 4i ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ConditionalExpression
src/fft.ts:93:22
     let Aimpair = new CpxTab(n/2);
 
     // partie pair
-    for ( let i = 0; i < n ; i+=2 ){
+    for ( let i = 0; false ; i+=2 ){
         Apair.set(i/2, x.get(i))
     }
killedBy: fft
statusReason: expected '[ 4 -4i -4 4i ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Survived] ArithmeticOperator
src/fft.ts:94:19
 
     // partie pair
     for ( let i = 0; i < n ; i+=2 ){
-        Apair.set(i/2, x.get(i))
+        Apair.set(i * 2, x.get(i))
     }
     // partie impair

[Killed] BlockStatement
src/fft.ts:97:36
         Apair.set(i/2, x.get(i))
     }
     // partie impair
-    for ( let i = 1; i < n ; i+=2 ){
-        Aimpair.set((i-1)/2, x.get(i))
-    }
+    for ( let i = 1; i < n ; i+=2 ){}
 
     let yPair = fft(Apair);
killedBy: fft
statusReason: expected '[ 1 1 1 1 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Killed] ConditionalExpression
src/fft.ts:97:22
         Apair.set(i/2, x.get(i))
     }
     // partie impair
-    for ( let i = 1; i < n ; i+=2 ){
+    for ( let i = 1; false ; i+=2 ){
         Aimpair.set((i-1)/2, x.get(i))
     }
killedBy: fft
statusReason: expected '[ 1 1 1 1 ]' to be '[ 10 -2-2i -2 -2+2i ]' // Object.is equality

[Survived] ArithmeticOperator
src/fft.ts:98:22
     }
     // partie impair
     for ( let i = 1; i < n ; i+=2 ){
-        Aimpair.set((i-1)/2, x.get(i))
+        Aimpair.set((i + 1)/2, x.get(i))
     }
 

[Survived] ArithmeticOperator
src/fft.ts:98:21
     }
     // partie impair
     for ( let i = 1; i < n ; i+=2 ){
-        Aimpair.set((i-1)/2, x.get(i))
+        Aimpair.set((i - 1) * 2, x.get(i))
     }
 

[Killed] BlockStatement
src/fft.ts:107:42
     return fftCombine(yPair,yImpair);
 }
         
-export function  ifft(y:CpxTab) : CpxTab {
-
-    let t = y.taille()
-    let taille = new CpxTab(t);
-
-    for (let i=0; i<t ; i++){
-        taille.set(i, new Complex(new Float(1,t)))
-    }
-
-    let step1 = y.conjugue()
-    let step2 = fft(step1)
-    let step3 = step2.conjugue()
-
-    return CpxTab.multiply(taille,step3);
-}	
+export function  ifft(y:CpxTab) : CpxTab {}	
 
 
killedBy: ifft
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] ConditionalExpression
src/fft.ts:112:19
     let t = y.taille()
     let taille = new CpxTab(t);
 
-    for (let i=0; i<t ; i++){
+    for (let i=0; false ; i++){
         taille.set(i, new Complex(new Float(1,t)))
     }
killedBy: ifft
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] BlockStatement
src/fft.ts:112:29
     let t = y.taille()
     let taille = new CpxTab(t);
 
-    for (let i=0; i<t ; i++){
-        taille.set(i, new Complex(new Float(1,t)))
-    }
+    for (let i=0; i<t ; i++){}
 
     let step1 = y.conjugue()
killedBy: ifft
statusReason: expected '[ 0 0 0 0 ]' to be '[ 1 2 3 4 ]' // Object.is equality
