[Killed] BlockStatement
src/float.ts:8:46
     private numerateur:number
     private denominateur:number
 
-    constructor (n : number, d : number = 1) {
-        if (d==0) {
-            throw new Error("Division by 0")
-        }
-
-        this.simplify(n * Math.sign(d),d * Math.sign(d))
-    }
+    constructor (n : number, d : number = 1) {}
 
     private simplify(n:number,d:number) {
killedBy: CpxTab
statusReason: expected '[ NaN+NaNi NaN+NaNi NaN+NaNi NaN+NaNi…' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] ConditionalExpression
src/float.ts:9:13
     private denominateur:number
 
     constructor (n : number, d : number = 1) {
-        if (d==0) {
+        if (true) {
             throw new Error("Division by 0")
         }
killedBy: Complex(1,1) is not real and imaginary
statusReason: Division by 0

[Killed] ConditionalExpression
src/float.ts:9:13
     private denominateur:number
 
     constructor (n : number, d : number = 1) {
-        if (d==0) {
+        if (false) {
             throw new Error("Division by 0")
         }
killedBy: 1/0 = Error
statusReason: expected [Function] to throw an error

[Survived] ArithmeticOperator
src/float.ts:13:40
             throw new Error("Division by 0")
         }
 
-        this.simplify(n * Math.sign(d),d * Math.sign(d))
+        this.simplify(n * Math.sign(d),d / Math.sign(d))
     }
 

[Survived] ArithmeticOperator
src/float.ts:13:23
             throw new Error("Division by 0")
         }
 
-        this.simplify(n * Math.sign(d),d * Math.sign(d))
+        this.simplify(n / Math.sign(d),d * Math.sign(d))
     }
 

[Killed] BlockStatement
src/float.ts:16:41
         this.simplify(n * Math.sign(d),d * Math.sign(d))
     }
 
-    private simplify(n:number,d:number) {
-        let div = pgcd(n,d)
-        this.numerateur = n/div
-        this.denominateur = d/div
-    }
+    private simplify(n:number,d:number) {}
 
     static pow(x:Float,n:number){
killedBy: Complex(1,0) is real
statusReason: expected false to be true // Object.is equality

[Timeout] ArithmeticOperator
src/float.ts:18:27
 
     private simplify(n:number,d:number) {
         let div = pgcd(n,d)
-        this.numerateur = n/div
+        this.numerateur = n * div
         this.denominateur = d/div
     }

[Killed] ArithmeticOperator
src/float.ts:19:29
     private simplify(n:number,d:number) {
         let div = pgcd(n,d)
         this.numerateur = n/div
-        this.denominateur = d/div
+        this.denominateur = d * div
     }
 
killedBy: 6/2 = 3
statusReason: expected 0.75 to be 3 // Object.is equality

[NoCoverage] BlockStatement
src/float.ts:22:33
         this.denominateur = d/div
     }
 
-    static pow(x:Float,n:number){
-        if (n===1){
-            return x
-        }
-        
-        let x2 = Float.multiply(x,x)
-
-        if (n%2===0)
-        {
-            return Float.pow(x2,n/2)
-        }
-
-        return Float.multiply(x,Float.pow(x2,(n-1)/2))
-    }
+    static pow(x:Float,n:number){}
 
     toString() {

[NoCoverage] ConditionalExpression
src/float.ts:23:13
     }
 
     static pow(x:Float,n:number){
-        if (n===1){
+        if (true){
             return x
         }

[NoCoverage] EqualityOperator
src/float.ts:23:13
     }
 
     static pow(x:Float,n:number){
-        if (n===1){
+        if (n !== 1){
             return x
         }

[NoCoverage] EqualityOperator
src/float.ts:29:13
         
         let x2 = Float.multiply(x,x)
 
-        if (n%2===0)
+        if (n % 2 !== 0)
         {
             return Float.pow(x2,n/2)

[NoCoverage] ConditionalExpression
src/float.ts:29:13
         
         let x2 = Float.multiply(x,x)
 
-        if (n%2===0)
+        if (false)
         {
             return Float.pow(x2,n/2)

[NoCoverage] BlockStatement
src/float.ts:30:9
         let x2 = Float.multiply(x,x)
 
         if (n%2===0)
-        {
-            return Float.pow(x2,n/2)
-        }
+        {}
 
         return Float.multiply(x,Float.pow(x2,(n-1)/2))

[NoCoverage] ArithmeticOperator
src/float.ts:31:33
 
         if (n%2===0)
         {
-            return Float.pow(x2,n/2)
+            return Float.pow(x2,n * 2)
         }
 

[NoCoverage] ArithmeticOperator
src/float.ts:34:47
             return Float.pow(x2,n/2)
         }
 
-        return Float.multiply(x,Float.pow(x2,(n-1)/2))
+        return Float.multiply(x,Float.pow(x2,(n + 1)/2))
     }
 

[NoCoverage] ArithmeticOperator
src/float.ts:34:46
             return Float.pow(x2,n/2)
         }
 
-        return Float.multiply(x,Float.pow(x2,(n-1)/2))
+        return Float.multiply(x,Float.pow(x2,(n - 1) * 2))
     }
 

[Killed] BlockStatement
src/float.ts:37:16
         return Float.multiply(x,Float.pow(x2,(n-1)/2))
     }
 
-    toString() {
-        if (this.denominateur === 1){
-            return `${this.numerateur}`
-        }
-        return `${this.numerateur}/${this.denominateur}`
-    }
+    toString() {}
 
     toNumber() {
killedBy: toString
statusReason: expected undefined to be '-2/7' // Object.is equality

[Killed] ConditionalExpression
src/float.ts:38:13
     }
 
     toString() {
-        if (this.denominateur === 1){
+        if (true){
             return `${this.numerateur}`
         }
killedBy: toString
statusReason: expected '-2' to be '-2/7' // Object.is equality

[Killed] BlockStatement
src/float.ts:38:37
     }
 
     toString() {
-        if (this.denominateur === 1){
-            return `${this.numerateur}`
-        }
+        if (this.denominateur === 1){}
         return `${this.numerateur}/${this.denominateur}`
     }
killedBy: toString
statusReason: expected '1/1' to be '1' // Object.is equality

[Killed] BlockStatement
src/float.ts:44:16
         return `${this.numerateur}/${this.denominateur}`
     }
 
-    toNumber() {
-        return this.numerateur/this.denominateur
-    }
+    toNumber() {}
 
     static multiply(f1:Float, f2:Float){
killedBy: CpxTab
statusReason: Cannot read properties of undefined (reading 'toFixed')

[Killed] ArithmeticOperator
src/float.ts:45:16
     }
 
     toNumber() {
-        return this.numerateur/this.denominateur
+        return this.numerateur * this.denominateur
     }
 
killedBy: 3/-2 = -3/2
statusReason: expected -6 to be -1.5 // Object.is equality

[Killed] BlockStatement
src/float.ts:48:40
         return this.numerateur/this.denominateur
     }
 
-    static multiply(f1:Float, f2:Float){
-        return new Float(f2.numerateur*f1.numerateur,f2.denominateur*f1.denominateur)
-    }
+    static multiply(f1:Float, f2:Float){}
 
     static add(f1:Float, f2:Float){
killedBy: 2/7 * 3/5  = 6/35
statusReason: expected undefined to strictly equal { Object (numerateur, denominateur) }

[Killed] ArithmeticOperator
src/float.ts:49:54
     }
 
     static multiply(f1:Float, f2:Float){
-        return new Float(f2.numerateur*f1.numerateur,f2.denominateur*f1.denominateur)
+        return new Float(f2.numerateur*f1.numerateur,f2.denominateur / f1.denominateur)
     }
 
killedBy: 2/7 * 3/5  = 6/35
statusReason: expected Float{ …(2) } to strictly equal { Object (numerateur, denominateur) }

[Timeout] ArithmeticOperator
src/float.ts:49:26
     }
 
     static multiply(f1:Float, f2:Float){
-        return new Float(f2.numerateur*f1.numerateur,f2.denominateur*f1.denominateur)
+        return new Float(f2.numerateur / f1.numerateur,f2.denominateur*f1.denominateur)
     }
 

[Killed] BlockStatement
src/float.ts:52:35
         return new Float(f2.numerateur*f1.numerateur,f2.denominateur*f1.denominateur)
     }
 
-    static add(f1:Float, f2:Float){
-        return new Float(f2.numerateur*f1.denominateur + f1.numerateur*f2.denominateur,f2.denominateur*f1.denominateur)
-    }
+    static add(f1:Float, f2:Float){}
 
     static substract(f1:Float, f2:Float){
killedBy: add
statusReason: expected Complex{ real: Float{ …(2) }, …(1) } to strictly equal Complex{ real: Float{ …(2) }, …(1) }

[Killed] ArithmeticOperator
src/float.ts:53:26
     }
 
     static add(f1:Float, f2:Float){
-        return new Float(f2.numerateur*f1.denominateur + f1.numerateur*f2.denominateur,f2.denominateur*f1.denominateur)
+        return new Float(f2.numerateur / f1.denominateur + f1.numerateur*f2.denominateur,f2.denominateur*f1.denominateur)
     }
 
killedBy: 2/7 + 3/5  = 31/35
statusReason: expected Float{ …(2) } to strictly equal Float{ numerateur: 31, …(1) }

[Killed] ArithmeticOperator
src/float.ts:53:58
     }
 
     static add(f1:Float, f2:Float){
-        return new Float(f2.numerateur*f1.denominateur + f1.numerateur*f2.denominateur,f2.denominateur*f1.denominateur)
+        return new Float(f2.numerateur*f1.denominateur + f1.numerateur / f2.denominateur,f2.denominateur*f1.denominateur)
     }
 
killedBy: 2/7 + 3/5  = 31/35
statusReason: expected Float{ …(2) } to strictly equal Float{ numerateur: 31, …(1) }

[Killed] BlockStatement
src/float.ts:56:41
         return new Float(f2.numerateur*f1.denominateur + f1.numerateur*f2.denominateur,f2.denominateur*f1.denominateur)
     }
 
-    static substract(f1:Float, f2:Float){
-        return this.add( f1, f2.opposite() )
-    }
+    static substract(f1:Float, f2:Float){}
 
     static divide(f1:Float, f2:Float){
killedBy: multiply
statusReason: expected Complex{ real: Float{ …(2) }, …(1) } to strictly equal Complex{ real: Float{ …(2) }, …(1) }

[Survived] BlockStatement
src/float.ts:60:38
         return this.add( f1, f2.opposite() )
     }
 
-    static divide(f1:Float, f2:Float){
-        return this.multiply(f1,f2.inverse())
-    }
+    static divide(f1:Float, f2:Float){}
 
     inverse(){

[Killed] BlockStatement
src/float.ts:64:14
         return this.multiply(f1,f2.inverse())
     }
 
-    inverse(){
-        return new Float(this.denominateur,this.numerateur)
-    }
+    inverse(){}
 
     opposite(){
killedBy: 0/1 . inverse = Error
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/float.ts:68:15
         return new Float(this.denominateur,this.numerateur)
     }
 
-    opposite(){
-        return new Float(-this.numerateur,this.denominateur)
-    }
+    opposite(){}
 
 }
killedBy: Conjugue
statusReason: expected Complex{ real: Float{ …(2) }, …(1) } to strictly equal Complex{ real: Float{ …(2) }, …(1) }

[Killed] UnaryOperator
src/float.ts:69:26
     }
 
     opposite(){
-        return new Float(-this.numerateur,this.denominateur)
+        return new Float(+this.numerateur,this.denominateur)
     }
 
killedBy: Conjugue
statusReason: expected Complex{ real: Float{ …(2) }, …(1) } to strictly equal Complex{ real: Float{ …(2) }, …(1) }
