[Killed] BlockStatement
src/matrix.ts:6:35
 
 class Size{
     constructor(public lines:number, public columns:number) {}
-    static equals(s1:Size,s2:Size){
-        return s1.lines === s2.lines && s2.columns === s1.columns
-    }
+    static equals(s1:Size,s2:Size){}
     toString() {
         return `{${this.lines}, ${this.columns}}`;
killedBy: Sum
statusReason: Matrix must be of same dimensions

[Killed] ConditionalExpression
src/matrix.ts:7:16
 class Size{
     constructor(public lines:number, public columns:number) {}
     static equals(s1:Size,s2:Size){
-        return s1.lines === s2.lines && s2.columns === s1.columns
+        return false
     }
     toString() {
killedBy: Sum
statusReason: Matrix must be of same dimensions

[Killed] EqualityOperator
src/matrix.ts:7:16
 class Size{
     constructor(public lines:number, public columns:number) {}
     static equals(s1:Size,s2:Size){
-        return s1.lines === s2.lines && s2.columns === s1.columns
+        return s1.lines !== s2.lines && s2.columns === s1.columns
     }
     toString() {
killedBy: Sum
statusReason: Matrix must be of same dimensions

[Killed] BlockStatement
src/matrix.ts:9:16
     static equals(s1:Size,s2:Size){
         return s1.lines === s2.lines && s2.columns === s1.columns
     }
-    toString() {
-        return `{${this.lines}, ${this.columns}}`;
-    }
+    toString() {}
 }
 
killedBy: Getter
statusReason: expected undefined to be '{2, 2}' // Object.is equality

[Survived] BlockStatement
src/matrix.ts:15:42
 }
 
 export class Matrix{
-    constructor(private list: Float[][]) {
-        let s = list[0].length;
-        for (let i = 1; i < list.length; i++) {
-            if (s!==list[i].length) {
-                throw "It is not a matrix"
-            }
-        }
-    }
+    constructor(private list: Float[][]) {}
 
     public get_matrix():Float[][]{

[Killed] EqualityOperator
src/matrix.ts:17:25
 export class Matrix{
     constructor(private list: Float[][]) {
         let s = list[0].length;
-        for (let i = 1; i < list.length; i++) {
+        for (let i = 1; i <= list.length; i++) {
             if (s!==list[i].length) {
                 throw "It is not a matrix"
killedBy: Eq retrieve y
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/matrix.ts:17:25
 export class Matrix{
     constructor(private list: Float[][]) {
         let s = list[0].length;
-        for (let i = 1; i < list.length; i++) {
+        for (let i = 1; i >= list.length; i++) {
             if (s!==list[i].length) {
                 throw "It is not a matrix"
killedBy: Eq retrieve y
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] ConditionalExpression
src/matrix.ts:18:17
     constructor(private list: Float[][]) {
         let s = list[0].length;
         for (let i = 1; i < list.length; i++) {
-            if (s!==list[i].length) {
+            if (true) {
                 throw "It is not a matrix"
             }

[NoCoverage] BlockStatement
src/matrix.ts:18:37
     constructor(private list: Float[][]) {
         let s = list[0].length;
         for (let i = 1; i < list.length; i++) {
-            if (s!==list[i].length) {
-                throw "It is not a matrix"
-            }
+            if (s!==list[i].length) {}
         }
     }

[Killed] BlockStatement
src/matrix.ts:24:34
         }
     }
 
-    public get_matrix():Float[][]{
-        return this.list;
-    }
+    public get_matrix():Float[][]{}
 
     public dimensions(): Size {
killedBy: Getter
statusReason: expected undefined to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:28:31
         return this.list;
     }
 
-    public dimensions(): Size {
-        return new Size(this.list.length,this.list[0].length);
-    }
+    public dimensions(): Size {}
 
     public inBounds(i,j){
killedBy: Eq retrieve y
statusReason: Cannot read properties of undefined (reading 'lines')

[Killed] BlockStatement
src/matrix.ts:32:25
         return new Size(this.list.length,this.list[0].length);
     }
 
-    public inBounds(i,j){
-        let dims = this.dimensions();
-
-        return (i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)
-    }
+    public inBounds(i,j){}
 
     public get(i:number,j:number): Float {
killedBy: Eq retrieve y
statusReason: Out of bounds 0 0 {1, 3}

[Killed] LogicalOperator
src/matrix.ts:35:17
     public inBounds(i,j){
         let dims = this.dimensions();
 
-        return (i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)
+        return (i >= 0 && j >= 0 && i < dims.lines || j < dims.columns)
     }
 
killedBy: OutOfBounds
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/matrix.ts:35:17
     public inBounds(i,j){
         let dims = this.dimensions();
 
-        return (i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)
+        return (i >= 0 || j >= 0 && i < dims.lines && j < dims.columns)
     }
 
killedBy: OutOfBounds
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/matrix.ts:38:42
         return (i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)
     }
 
-    public get(i:number,j:number): Float {
-        if (!this.inBounds(i,j)) {
-            throw `Out of bounds ${i} ${j} ${this.dimensions().toString()}`;
-        }
-        return this.list[i][j];
-    }
+    public get(i:number,j:number): Float {}
 
     public extractLine(i:number){
killedBy: Eq retrieve y
statusReason: Cannot read properties of undefined (reading 'numerateur')

[Killed] BooleanLiteral
src/matrix.ts:39:13
     }
 
     public get(i:number,j:number): Float {
-        if (!this.inBounds(i,j)) {
+        if (this.inBounds(i, j)) {
             throw `Out of bounds ${i} ${j} ${this.dimensions().toString()}`;
         }
killedBy: Eq retrieve y
statusReason: Out of bounds 0 0 {1, 3}

[Killed] ConditionalExpression
src/matrix.ts:39:13
     }
 
     public get(i:number,j:number): Float {
-        if (!this.inBounds(i,j)) {
+        if (true) {
             throw `Out of bounds ${i} ${j} ${this.dimensions().toString()}`;
         }
killedBy: Eq retrieve y
statusReason: Out of bounds 0 0 {1, 3}

[NoCoverage] BlockStatement
src/matrix.ts:45:33
         return this.list[i][j];
     }
 
-    public extractLine(i:number){
-        if (!this.inBounds(i,0)) {
-            throw `Out of bounds ${i} ${this.dimensions().toString()}`;
-        }
-
-        return [...this.get_matrix[i]]
-    }
+    public extractLine(i:number){}
 
     public extractColumns(j:number){

[NoCoverage] ConditionalExpression
src/matrix.ts:46:13
     }
 
     public extractLine(i:number){
-        if (!this.inBounds(i,0)) {
+        if (false) {
             throw `Out of bounds ${i} ${this.dimensions().toString()}`;
         }

[NoCoverage] BlockStatement
src/matrix.ts:46:34
     }
 
     public extractLine(i:number){
-        if (!this.inBounds(i,0)) {
-            throw `Out of bounds ${i} ${this.dimensions().toString()}`;
-        }
+        if (!this.inBounds(i,0)) {}
 
         return [...this.get_matrix[i]]

[NoCoverage] StringLiteral
src/matrix.ts:47:19
 
     public extractLine(i:number){
         if (!this.inBounds(i,0)) {
-            throw `Out of bounds ${i} ${this.dimensions().toString()}`;
+            throw ``;
         }
 

[NoCoverage] BlockStatement
src/matrix.ts:53:36
         return [...this.get_matrix[i]]
     }
 
-    public extractColumns(j:number){
-        if (!this.inBounds(0,j)) {
-            throw `Out of bounds ${j} ${this.dimensions().toString()}`;
-        }
-
-        let returnV = []
-        for (let i = 0; i < this.dimensions().lines; i++) {
-            returnV.push( this.list[i][j] )
-        }
-        return returnV;
-
-    }
+    public extractColumns(j:number){}
 
     public set(i:number,j:number, value:Float) {

[NoCoverage] BlockStatement
src/matrix.ts:54:34
     }
 
     public extractColumns(j:number){
-        if (!this.inBounds(0,j)) {
-            throw `Out of bounds ${j} ${this.dimensions().toString()}`;
-        }
+        if (!this.inBounds(0,j)) {}
 
         let returnV = []

[NoCoverage] ConditionalExpression
src/matrix.ts:54:13
     }
 
     public extractColumns(j:number){
-        if (!this.inBounds(0,j)) {
+        if (false) {
             throw `Out of bounds ${j} ${this.dimensions().toString()}`;
         }

[NoCoverage] StringLiteral
src/matrix.ts:55:19
 
     public extractColumns(j:number){
         if (!this.inBounds(0,j)) {
-            throw `Out of bounds ${j} ${this.dimensions().toString()}`;
+            throw ``;
         }
 

[NoCoverage] UpdateOperator
src/matrix.ts:59:54
         }
 
         let returnV = []
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; i < this.dimensions().lines; i--) {
             returnV.push( this.list[i][j] )
         }

[NoCoverage] EqualityOperator
src/matrix.ts:59:25
         }
 
         let returnV = []
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; i <= this.dimensions().lines; i++) {
             returnV.push( this.list[i][j] )
         }

[Killed] BlockStatement
src/matrix.ts:66:48
 
     }
 
-    public set(i:number,j:number, value:Float) {
-        if (!this.inBounds(i,j)) {
-            throw `Out of bounds ${i} ${j} ${this.dimensions().toString()}`;
-        }
-        this.list[i][j] = value
-    }
+    public set(i:number,j:number, value:Float) {}
 
     public static add(m1:Matrix,m2:Matrix){
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Survived] ConditionalExpression
src/matrix.ts:67:13
     }
 
     public set(i:number,j:number, value:Float) {
-        if (!this.inBounds(i,j)) {
+        if (true) {
             throw `Out of bounds ${i} ${j} ${this.dimensions().toString()}`;
         }

[Survived] BooleanLiteral
src/matrix.ts:67:13
     }
 
     public set(i:number,j:number, value:Float) {
-        if (!this.inBounds(i,j)) {
+        if (this.inBounds(i, j)) {
             throw `Out of bounds ${i} ${j} ${this.dimensions().toString()}`;
         }

[Killed] BlockStatement
src/matrix.ts:73:43
         this.list[i][j] = value
     }
 
-    public static add(m1:Matrix,m2:Matrix){
-        if (!Size.equals(m1.dimensions(),m2.dimensions())) {
-            throw "Matrix must be of same dimensions";
-        }
-
-        let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
-
-        for (let i = 0; i < m1.dimensions().lines; i++) {
-            for (let j = 0; j < m1.dimensions().columns; j++) {
-                return_class.set(i,j, Float.add(m1.list[i][j],m2.list[i][j]) )
-            }
-        }
-        return return_class;
-    }
+    public static add(m1:Matrix,m2:Matrix){}
 
     public static substract(m1:Matrix,m2:Matrix){
killedBy: Sum
statusReason: Cannot read properties of undefined (reading 'get_matrix')

[Killed] BooleanLiteral
src/matrix.ts:74:13
     }
 
     public static add(m1:Matrix,m2:Matrix){
-        if (!Size.equals(m1.dimensions(),m2.dimensions())) {
+        if (Size.equals(m1.dimensions(), m2.dimensions())) {
             throw "Matrix must be of same dimensions";
         }
killedBy: Sum
statusReason: Matrix must be of same dimensions

[Killed] ConditionalExpression
src/matrix.ts:74:13
     }
 
     public static add(m1:Matrix,m2:Matrix){
-        if (!Size.equals(m1.dimensions(),m2.dimensions())) {
+        if (true) {
             throw "Matrix must be of same dimensions";
         }
killedBy: Sum
statusReason: Matrix must be of same dimensions

[NoCoverage] StringLiteral
src/matrix.ts:75:19
 
     public static add(m1:Matrix,m2:Matrix){
         if (!Size.equals(m1.dimensions(),m2.dimensions())) {
-            throw "Matrix must be of same dimensions";
+            throw "";
         }
 

[Killed] ConditionalExpression
src/matrix.ts:80:25
 
         let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
 
-        for (let i = 0; i < m1.dimensions().lines; i++) {
+        for (let i = 0; false; i++) {
             for (let j = 0; j < m1.dimensions().columns; j++) {
                 return_class.set(i,j, Float.add(m1.list[i][j],m2.list[i][j]) )
killedBy: Sum
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] UpdateOperator
src/matrix.ts:80:52
 
         let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
 
-        for (let i = 0; i < m1.dimensions().lines; i++) {
+        for (let i = 0; i < m1.dimensions().lines; i--) {
             for (let j = 0; j < m1.dimensions().columns; j++) {
                 return_class.set(i,j, Float.add(m1.list[i][j],m2.list[i][j]) )
killedBy: Sum
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/matrix.ts:81:29
         let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
 
         for (let i = 0; i < m1.dimensions().lines; i++) {
-            for (let j = 0; j < m1.dimensions().columns; j++) {
+            for (let j = 0; j >= m1.dimensions().columns; j++) {
                 return_class.set(i,j, Float.add(m1.list[i][j],m2.list[i][j]) )
             }
killedBy: Sum
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:81:63
         let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
 
         for (let i = 0; i < m1.dimensions().lines; i++) {
-            for (let j = 0; j < m1.dimensions().columns; j++) {
-                return_class.set(i,j, Float.add(m1.list[i][j],m2.list[i][j]) )
-            }
+            for (let j = 0; j < m1.dimensions().columns; j++) {}
         }
         return return_class;
killedBy: Sum
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[NoCoverage] BlockStatement
src/matrix.ts:88:49
         return return_class;
     }
 
-    public static substract(m1:Matrix,m2:Matrix){
-        let m3 = m2.clone()
-        m3.operate_by((i)=>{return -i})
-        return Matrix.add(m1,m3);
-    }
+    public static substract(m1:Matrix,m2:Matrix){}
 
 

[NoCoverage] UnaryOperator
src/matrix.ts:90:36
 
     public static substract(m1:Matrix,m2:Matrix){
         let m3 = m2.clone()
-        m3.operate_by((i)=>{return -i})
+        m3.operate_by((i)=>{return +i})
         return Matrix.add(m1,m3);
     }

[NoCoverage] BlockStatement
src/matrix.ts:90:28
 
     public static substract(m1:Matrix,m2:Matrix){
         let m3 = m2.clone()
-        m3.operate_by((i)=>{return -i})
+        m3.operate_by((i)=>{})
         return Matrix.add(m1,m3);
     }

[Killed] BlockStatement
src/matrix.ts:95:48
     }
 
 
-    public static multiply(m1:Matrix,m2:Matrix){
-        if (m1.dimensions().columns !== m2.dimensions().lines) {
-            throw "Matrix must be multiply-able";
-        }
-
-        let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
-
-        for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
-                let value = new Float(0)
-
-                for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value = Float.add(value,Float.multiply(m1.get(i,k), m2.get(k,j)));
-                }
-
-                return_class.set(i,j, value)
-            }
-        }
-
-        return return_class;
-    }
+    public static multiply(m1:Matrix,m2:Matrix){}
 
     public operate_by(f:Function){
killedBy: Multiplication
statusReason: Cannot read properties of undefined (reading 'get_matrix')

[Killed] ConditionalExpression
src/matrix.ts:96:13
 
 
     public static multiply(m1:Matrix,m2:Matrix){
-        if (m1.dimensions().columns !== m2.dimensions().lines) {
+        if (true) {
             throw "Matrix must be multiply-able";
         }
killedBy: Multiplication
statusReason: Matrix must be multiply-able

[Killed] EqualityOperator
src/matrix.ts:96:13
 
 
     public static multiply(m1:Matrix,m2:Matrix){
-        if (m1.dimensions().columns !== m2.dimensions().lines) {
+        if (m1.dimensions().columns === m2.dimensions().lines) {
             throw "Matrix must be multiply-able";
         }
killedBy: Multiplication
statusReason: Matrix must be multiply-able

[Killed] BlockStatement
src/matrix.ts:102:67
 
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
-        for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
-                let value = new Float(0)
-
-                for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value = Float.add(value,Float.multiply(m1.get(i,k), m2.get(k,j)));
-                }
-
-                return_class.set(i,j, value)
-            }
-        }
+        for (let i = 0; i < return_class.dimensions().lines; i++) {}
 
         return return_class;
killedBy: Multiplication
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] ConditionalExpression
src/matrix.ts:102:25
 
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
-        for (let i = 0; i < return_class.dimensions().lines; i++) {
+        for (let i = 0; false; i++) {
             for (let j = 0; j < return_class.dimensions().columns; j++) {
                 let value = new Float(0)
killedBy: Multiplication
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:103:29
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
         for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
+            for (let j = 0; j >= return_class.dimensions().columns; j++) {
                 let value = new Float(0)
 
killedBy: Multiplication
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] UpdateOperator
src/matrix.ts:103:68
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
         for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
+            for (let j = 0; j < return_class.dimensions().columns; j--) {
                 let value = new Float(0)
 
killedBy: Multiplication
statusReason: Out of bounds 0 -1 {2, 2}

[Killed] BlockStatement
src/matrix.ts:106:67
             for (let j = 0; j < return_class.dimensions().columns; j++) {
                 let value = new Float(0)
 
-                for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value = Float.add(value,Float.multiply(m1.get(i,k), m2.get(k,j)));
-                }
+                for (let k = 0; k < m1.dimensions().columns; k++) {}
 
                 return_class.set(i,j, value)
killedBy: Multiplication
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:106:33
             for (let j = 0; j < return_class.dimensions().columns; j++) {
                 let value = new Float(0)
 
-                for (let k = 0; k < m1.dimensions().columns; k++) {
+                for (let k = 0; k <= m1.dimensions().columns; k++) {
                     value = Float.add(value,Float.multiply(m1.get(i,k), m2.get(k,j)));
                 }
killedBy: Multiplication
statusReason: Out of bounds 0 2 {2, 2}

[NoCoverage] BlockStatement
src/matrix.ts:117:34
         return return_class;
     }
 
-    public operate_by(f:Function){
-        for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
-                this.set(i,j, f(this.get(i,j)));
-            }
-        }
-    }
+    public operate_by(f:Function){}
 
     public operate_line_by(f:Function,i:number){

[NoCoverage] BlockStatement
src/matrix.ts:118:59
     }
 
     public operate_by(f:Function){
-        for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
-                this.set(i,j, f(this.get(i,j)));
-            }
-        }
+        for (let i = 0; i < this.dimensions().lines; i++) {}
     }
 

[NoCoverage] UpdateOperator
src/matrix.ts:118:54
     }
 
     public operate_by(f:Function){
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; i < this.dimensions().lines; i--) {
             for (let j = 0; j < this.dimensions().columns; j++) {
                 this.set(i,j, f(this.get(i,j)));

[NoCoverage] ConditionalExpression
src/matrix.ts:119:29
 
     public operate_by(f:Function){
         for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
+            for (let j = 0; false; j++) {
                 this.set(i,j, f(this.get(i,j)));
             }

[NoCoverage] EqualityOperator
src/matrix.ts:119:29
 
     public operate_by(f:Function){
         for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
+            for (let j = 0; j <= this.dimensions().columns; j++) {
                 this.set(i,j, f(this.get(i,j)));
             }

[Survived] BlockStatement
src/matrix.ts:125:48
         }
     }
 
-    public operate_line_by(f:Function,i:number){
-        for (let j = 0; j < this.dimensions().columns; j++) {
-            this.set(i,j, f(this.get(i,j)));
-        }
-    }
+    public operate_line_by(f:Function,i:number){}
 
     public operate_column_by(f:Function,j:number){

[Survived] EqualityOperator
src/matrix.ts:126:25
     }
 
     public operate_line_by(f:Function,i:number){
-        for (let j = 0; j < this.dimensions().columns; j++) {
+        for (let j = 0; j >= this.dimensions().columns; j++) {
             this.set(i,j, f(this.get(i,j)));
         }

[Survived] UpdateOperator
src/matrix.ts:126:56
     }
 
     public operate_line_by(f:Function,i:number){
-        for (let j = 0; j < this.dimensions().columns; j++) {
+        for (let j = 0; j < this.dimensions().columns; j--) {
             this.set(i,j, f(this.get(i,j)));
         }

[NoCoverage] BlockStatement
src/matrix.ts:131:50
         }
     }
 
-    public operate_column_by(f:Function,j:number){
-        for (let i = 0; i < this.dimensions().lines; i++) {
-            this.set(i,j, f(this.get(i,j)));
-        }
-    }
+    public operate_column_by(f:Function,j:number){}
 
     public swap_lines(i1:number,i2:number){

[NoCoverage] ConditionalExpression
src/matrix.ts:132:25
     }
 
     public operate_column_by(f:Function,j:number){
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; false; i++) {
             this.set(i,j, f(this.get(i,j)));
         }

[NoCoverage] EqualityOperator
src/matrix.ts:132:25
     }
 
     public operate_column_by(f:Function,j:number){
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; i <= this.dimensions().lines; i++) {
             this.set(i,j, f(this.get(i,j)));
         }

[Killed] BlockStatement
src/matrix.ts:137:43
         }
     }
 
-    public swap_lines(i1:number,i2:number){
-        let temp = this.list[i1]
-        this.list[i1] = this.list[i2]
-        this.list[i2] = temp
-    }
+    public swap_lines(i1:number,i2:number){}
 
     public clone() {
killedBy: Simplify
statusReason: expected [ [ …(3) ], …(2) ] to strictly equal [ [ …(3) ], …(2) ]

[Survived] BlockStatement
src/matrix.ts:143:20
         this.list[i2] = temp
     }
 
-    public clone() {
-        let dims = this.dimensions()
-        let return_matrix = new EmptyMatrix(dims.lines,dims.columns)
-        for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
-                return_matrix.set(i,j, this.get(i,j));
-            }
-        }
-        return return_matrix;
-    }
+    public clone() {}
 
     private static descenteGauss(m1:Matrix,inversed:boolean) {

[Killed] ConditionalExpression
src/matrix.ts:146:25
     public clone() {
         let dims = this.dimensions()
         let return_matrix = new EmptyMatrix(dims.lines,dims.columns)
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; false; i++) {
             for (let j = 0; j < this.dimensions().columns; j++) {
                 return_matrix.set(i,j, this.get(i,j));
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:146:25
     public clone() {
         let dims = this.dimensions()
         let return_matrix = new EmptyMatrix(dims.lines,dims.columns)
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; i >= this.dimensions().lines; i++) {
             for (let j = 0; j < this.dimensions().columns; j++) {
                 return_matrix.set(i,j, this.get(i,j));
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:147:65
         let dims = this.dimensions()
         let return_matrix = new EmptyMatrix(dims.lines,dims.columns)
         for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
-                return_matrix.set(i,j, this.get(i,j));
-            }
+            for (let j = 0; j < this.dimensions().columns; j++) {}
         }
         return return_matrix;
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:147:29
         let dims = this.dimensions()
         let return_matrix = new EmptyMatrix(dims.lines,dims.columns)
         for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
+            for (let j = 0; j >= this.dimensions().columns; j++) {
                 return_matrix.set(i,j, this.get(i,j));
             }
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Survived] UnaryOperator
src/matrix.ts:161:16
         let m = m1.clone()
         let return_matrix = new IdentityMatrix(dims.lines,dims.columns);
 
-        let r= -1
+        let r= +1
 
         for (let j = 0; j < dims.columns; j++) {

[Killed] EqualityOperator
src/matrix.ts:163:25
 
         let r= -1
 
-        for (let j = 0; j < dims.columns; j++) {
+        for (let j = 0; j >= dims.columns; j++) {
             let k = 0
             let max = -Infinity
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] ConditionalExpression
src/matrix.ts:163:25
 
         let r= -1
 
-        for (let j = 0; j < dims.columns; j++) {
+        for (let j = 0; false; j++) {
             let k = 0
             let max = -Infinity
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] UnaryOperator
src/matrix.ts:165:23
 
         for (let j = 0; j < dims.columns; j++) {
             let k = 0
-            let max = -Infinity
+            let max = +Infinity
 
             for (let i = r+1; i < dims.lines; i++) {
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ …(2) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:167:52
             let k = 0
             let max = -Infinity
 
-            for (let i = r+1; i < dims.lines; i++) {
-                if (m.get(i,j).toNumber() >= max) {
-                    k = i
-                    max = m.get(i,j).toNumber()
-                }
-            }
+            for (let i = r+1; i < dims.lines; i++) {}
 
             let coef = m.get(k,j)
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ …(2) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:167:31
             let k = 0
             let max = -Infinity
 
-            for (let i = r+1; i < dims.lines; i++) {
+            for (let i = r+1; i >= dims.lines; i++) {
                 if (m.get(i,j).toNumber() >= max) {
                     k = i
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ …(2) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:168:51
             let max = -Infinity
 
             for (let i = r+1; i < dims.lines; i++) {
-                if (m.get(i,j).toNumber() >= max) {
-                    k = i
-                    max = m.get(i,j).toNumber()
-                }
+                if (m.get(i,j).toNumber() >= max) {}
             }
 
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ …(2) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] ConditionalExpression
src/matrix.ts:168:21
             let max = -Infinity
 
             for (let i = r+1; i < dims.lines; i++) {
-                if (m.get(i,j).toNumber() >= max) {
+                if (false) {
                     k = i
                     max = m.get(i,j).toNumber()
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ …(2) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]
