[Killed] ConditionalExpression
src/matrix.ts:175:17
             }
 
             let coef = m.get(k,j)
-            if (coef.toNumber() !== 0) {
+            if (false) {
                 r++
                 m.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:175:17
             }
 
             let coef = m.get(k,j)
-            if (coef.toNumber() !== 0) {
+            if (coef.toNumber() === 0) {
                 r++
                 m.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Survived] UpdateOperator
src/matrix.ts:176:17
 
             let coef = m.get(k,j)
             if (coef.toNumber() !== 0) {
-                r++
+                r--
                 m.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
                 return_matrix.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)

[Survived] BlockStatement
src/matrix.ts:177:46
             let coef = m.get(k,j)
             if (coef.toNumber() !== 0) {
                 r++
-                m.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
+                m.operate_line_by((n:Float)=>{},k)
                 return_matrix.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
 

[Survived] BlockStatement
src/matrix.ts:178:58
             if (coef.toNumber() !== 0) {
                 r++
                 m.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
-                return_matrix.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
+                return_matrix.operate_line_by((n:Float)=>{},k)
 
                 if (k!==r){

[Killed] EqualityOperator
src/matrix.ts:180:21
                 m.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
                 return_matrix.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
 
-                if (k!==r){
+                if (k === r){
                     m.swap_lines(k,r)
                     return_matrix.swap_lines(k,r)
killedBy: Simplify
statusReason: expected [ [ …(3) ], …(2) ] to strictly equal [ [ …(3) ], …(2) ]

[Killed] BlockStatement
src/matrix.ts:180:27
                 m.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
                 return_matrix.operate_line_by((n:Float)=>{return Float.divide(n,coef)},k)
 
-                if (k!==r){
-                    m.swap_lines(k,r)
-                    return_matrix.swap_lines(k,r)
-                }
+                if (k!==r){}
                 for (let i = 0; i < dims.lines; i++) {
                     let coef2 = m.get(i,j)
killedBy: Simplify
statusReason: expected [ [ …(3) ], …(2) ] to strictly equal [ [ …(3) ], …(2) ]

[Killed] EqualityOperator
src/matrix.ts:184:33
                     m.swap_lines(k,r)
                     return_matrix.swap_lines(k,r)
                 }
-                for (let i = 0; i < dims.lines; i++) {
+                for (let i = 0; i >= dims.lines; i++) {
                     let coef2 = m.get(i,j)
                     if (i!==r){
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:184:54
                     m.swap_lines(k,r)
                     return_matrix.swap_lines(k,r)
                 }
-                for (let i = 0; i < dims.lines; i++) {
-                    let coef2 = m.get(i,j)
-                    if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
-                            let c3 = Float.multiply(coef2,return_matrix.get(r,o))
-                            let c2 = Float.multiply(coef2,m.get(r,o))
-                            return_matrix.set(i,o,Float.substract(return_matrix.get(i,o),c3))
-                            m.set(i,o,Float.substract(m.get(i,o),c2))
-
-                        }
-                    }
-                }
+                for (let i = 0; i < dims.lines; i++) {}
             }
         }
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:186:25
                 }
                 for (let i = 0; i < dims.lines; i++) {
                     let coef2 = m.get(i,j)
-                    if (i!==r){
+                    if (i === r){
                         for (let o=0;o<dims.columns; o++) {
                             let c3 = Float.multiply(coef2,return_matrix.get(r,o))
killedBy: Inverse
statusReason: expected [ …(2) ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:186:31
                 }
                 for (let i = 0; i < dims.lines; i++) {
                     let coef2 = m.get(i,j)
-                    if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
-                            let c3 = Float.multiply(coef2,return_matrix.get(r,o))
-                            let c2 = Float.multiply(coef2,m.get(r,o))
-                            return_matrix.set(i,o,Float.substract(return_matrix.get(i,o),c3))
-                            m.set(i,o,Float.substract(m.get(i,o),c2))
-
-                        }
-                    }
+                    if (i!==r){}
                 }
             }
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] EqualityOperator
src/matrix.ts:187:38
                 for (let i = 0; i < dims.lines; i++) {
                     let coef2 = m.get(i,j)
                     if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
+                        for (let o=0;o >= dims.columns; o++) {
                             let c3 = Float.multiply(coef2,return_matrix.get(r,o))
                             let c2 = Float.multiply(coef2,m.get(r,o))
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:187:59
                 for (let i = 0; i < dims.lines; i++) {
                     let coef2 = m.get(i,j)
                     if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
-                            let c3 = Float.multiply(coef2,return_matrix.get(r,o))
-                            let c2 = Float.multiply(coef2,m.get(r,o))
-                            return_matrix.set(i,o,Float.substract(return_matrix.get(i,o),c3))
-                            m.set(i,o,Float.substract(m.get(i,o),c2))
-
-                        }
+                        for (let o=0;o<dims.columns; o++) {}
                     }
                 }
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:202:21
         return inversed ? return_matrix : m;
     }
 
-    public inverse(){
-        return Matrix.descenteGauss(this,true)
-    }
+    public inverse(){}
 
     public simplify(){
killedBy: Inverse
statusReason: Cannot read properties of undefined (reading 'dimensions')

[Killed] BooleanLiteral
src/matrix.ts:203:42
     }
 
     public inverse(){
-        return Matrix.descenteGauss(this,true)
+        return Matrix.descenteGauss(this,false)
     }
 
killedBy: Inverse
statusReason: expected [ [ …(2) ], [ Float{ …(2) }, …(1) ] ] to strictly equal [ [ …(2) ], [ Float{ …(2) }, …(1) ] ]

[Killed] BlockStatement
src/matrix.ts:206:22
         return Matrix.descenteGauss(this,true)
     }
 
-    public simplify(){
-        return Matrix.descenteGauss(this,false)
-    }
+    public simplify(){}
 }
 
killedBy: Simplify
statusReason: Cannot read properties of undefined (reading 'get_matrix')

[Killed] BooleanLiteral
src/matrix.ts:207:42
     }
 
     public simplify(){
-        return Matrix.descenteGauss(this,false)
+        return Matrix.descenteGauss(this,true)
     }
 }
killedBy: Simplify
statusReason: expected [ [ Float{ …(2) }, …(2) ], …(2) ] to strictly equal [ [ …(3) ], …(2) ]

[Survived] BlockStatement
src/matrix.ts:212:41
 }
 
 export class EmptyMatrix extends Matrix{
-    constructor(l : number, c : number) {
-        let list:Float[][]=[]
-
-        for (let i = 0; i < l; i++) {
-            list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(new Float(0));
-            }
-        }
-
-        super(list)
-    }
+    constructor(l : number, c : number) {}
 }
 

[Killed] EqualityOperator
src/matrix.ts:215:25
     constructor(l : number, c : number) {
         let list:Float[][]=[]
 
-        for (let i = 0; i < l; i++) {
+        for (let i = 0; i <= l; i++) {
             list.push([]);
             for (let j = 0; j < c; j++) {
killedBy: Multiplication
statusReason: Out of bounds 2 0 {2, 2}

[Survived] BlockStatement
src/matrix.ts:215:37
     constructor(l : number, c : number) {
         let list:Float[][]=[]
 
-        for (let i = 0; i < l; i++) {
-            list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(new Float(0));
-            }
-        }
+        for (let i = 0; i < l; i++) {}
 
         super(list)

[Killed] EqualityOperator
src/matrix.ts:217:29
 
         for (let i = 0; i < l; i++) {
             list.push([]);
-            for (let j = 0; j < c; j++) {
+            for (let j = 0; j <= c; j++) {
                 list[i].push(new Float(0));
             }
killedBy: Multiplication
statusReason: Out of bounds 0 2 {2, 2}

[Survived] ConditionalExpression
src/matrix.ts:217:29
 
         for (let i = 0; i < l; i++) {
             list.push([]);
-            for (let j = 0; j < c; j++) {
+            for (let j = 0; false; j++) {
                 list[i].push(new Float(0));
             }

[Survived] BlockStatement
src/matrix.ts:227:41
 }
 
 export class IdentityMatrix extends Matrix{
-    constructor(l : number, c : number) {
-        let list:Float[][]=[]
-
-        for (let i = 0; i < l; i++) {
-            list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? new Float(1) : new Float(0));
-            }
-        }
-
-        super(list)
-    }
+    constructor(l : number, c : number) {}
 }

[Survived] BlockStatement
src/matrix.ts:230:37
     constructor(l : number, c : number) {
         let list:Float[][]=[]
 
-        for (let i = 0; i < l; i++) {
-            list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? new Float(1) : new Float(0));
-            }
-        }
+        for (let i = 0; i < l; i++) {}
 
         super(list)

[Timeout] ArrayDeclaration
src/matrix.ts:231:23
         let list:Float[][]=[]
 
         for (let i = 0; i < l; i++) {
-            list.push([]);
+            list.push(["Stryker was here"]);
             for (let j = 0; j < c; j++) {
                 list[i].push(i===j ? new Float(1) : new Float(0));

[Survived] BlockStatement
src/matrix.ts:232:41
 
         for (let i = 0; i < l; i++) {
             list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? new Float(1) : new Float(0));
-            }
+            for (let j = 0; j < c; j++) {}
         }
 

[Killed] ConditionalExpression
src/matrix.ts:233:30
         for (let i = 0; i < l; i++) {
             list.push([]);
             for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? new Float(1) : new Float(0));
+                list[i].push(false ? new Float(1) : new Float(0));
             }
         }
killedBy: Identity
statusReason: expected [ [ Float{ …(2) }, …(2) ], …(1) ] to strictly equal [ [ …(3) ], [ Float{ …(2) }, …(2) ] ]

[Killed] ConditionalExpression
src/matrix.ts:233:30
         for (let i = 0; i < l; i++) {
             list.push([]);
             for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? new Float(1) : new Float(0));
+                list[i].push(true ? new Float(1) : new Float(0));
             }
         }
killedBy: Identity
statusReason: expected [ [ …(3) ], [ …(3) ] ] to strictly equal [ [ …(3) ], [ Float{ …(2) }, …(2) ] ]
