[NoCoverage] BlockStatement
src/plan.ts:7:21
 
 class Dimensional {
     constructor( private dim :number ) {}
-    get dimension() { return this.dim }
+    get dimension() {}
 }
 

[NoCoverage] BlockStatement
src/plan.ts:15:18
         super(c.length)        
     }
 
-    get(i:number){
-        return this.c[i]
-    }
+    get(i:number){}
 
     static substract(p1:Point,p2:Point){

[NoCoverage] BlockStatement
src/plan.ts:19:40
         return this.c[i]
     }
 
-    static substract(p1:Point,p2:Point){
-        if (p1.dimension !== p2.dimension){
-            throw new Error("Points dimension need to be the same")
-        }
-
-        let a:number[] = []
-        for (let i = 0; i < p1.dimension; i++){
-            a.push(p1.get(i)-p2.get(i))
-        }
-        return new Point(a) 
-    }
+    static substract(p1:Point,p2:Point){}
 }
 

[NoCoverage] ConditionalExpression
src/plan.ts:20:13
     }
 
     static substract(p1:Point,p2:Point){
-        if (p1.dimension !== p2.dimension){
+        if (true){
             throw new Error("Points dimension need to be the same")
         }

[NoCoverage] ConditionalExpression
src/plan.ts:20:13
     }
 
     static substract(p1:Point,p2:Point){
-        if (p1.dimension !== p2.dimension){
+        if (false){
             throw new Error("Points dimension need to be the same")
         }

[NoCoverage] ArrayDeclaration
src/plan.ts:24:26
             throw new Error("Points dimension need to be the same")
         }
 
-        let a:number[] = []
+        let a:number[] = ["Stryker was here"]
         for (let i = 0; i < p1.dimension; i++){
             a.push(p1.get(i)-p2.get(i))

[NoCoverage] EqualityOperator
src/plan.ts:25:25
         }
 
         let a:number[] = []
-        for (let i = 0; i < p1.dimension; i++){
+        for (let i = 0; i >= p1.dimension; i++){
             a.push(p1.get(i)-p2.get(i))
         }

[NoCoverage] UpdateOperator
src/plan.ts:25:43
         }
 
         let a:number[] = []
-        for (let i = 0; i < p1.dimension; i++){
+        for (let i = 0; i < p1.dimension; i--){
             a.push(p1.get(i)-p2.get(i))
         }

[NoCoverage] ArithmeticOperator
src/plan.ts:26:20
 
         let a:number[] = []
         for (let i = 0; i < p1.dimension; i++){
-            a.push(p1.get(i)-p2.get(i))
+            a.push(p1.get(i) + p2.get(i))
         }
         return new Point(a) 

[NoCoverage] ConditionalExpression
src/plan.ts:34:13
 
 export class Vector extends Dimensional{
     constructor ( private p1, private p2 ){
-        if (p1.dimension !== p2.dimension){
+        if (true){
             throw new Error("Points dimension need to be the same")
         }

[NoCoverage] BlockStatement
src/plan.ts:34:43
 
 export class Vector extends Dimensional{
     constructor ( private p1, private p2 ){
-        if (p1.dimension !== p2.dimension){
-            throw new Error("Points dimension need to be the same")
-        }
+        if (p1.dimension !== p2.dimension){}
         super(p1.dimension)
     }

[NoCoverage] StringLiteral
src/plan.ts:35:29
 export class Vector extends Dimensional{
     constructor ( private p1, private p2 ){
         if (p1.dimension !== p2.dimension){
-            throw new Error("Points dimension need to be the same")
+            throw new Error("")
         }
         super(p1.dimension)

[NoCoverage] BlockStatement
src/plan.ts:40:18
         super(p1.dimension)
     }
 
-    get vector() {
-        let a:number[] = []
-        for (let i = 0; i < this.p1.dimension; i++){
-            a.push(this.p2.get(i)-this.p1.get(i))
-        }
-        return a
-    }
+    get vector() {}
 
     public static scalar(v1:Vector, v2:Vector){

[NoCoverage] ConditionalExpression
src/plan.ts:42:25
 
     get vector() {
         let a:number[] = []
-        for (let i = 0; i < this.p1.dimension; i++){
+        for (let i = 0; false; i++){
             a.push(this.p2.get(i)-this.p1.get(i))
         }

[NoCoverage] EqualityOperator
src/plan.ts:42:25
 
     get vector() {
         let a:number[] = []
-        for (let i = 0; i < this.p1.dimension; i++){
+        for (let i = 0; i <= this.p1.dimension; i++){
             a.push(this.p2.get(i)-this.p1.get(i))
         }

[NoCoverage] ArithmeticOperator
src/plan.ts:43:20
     get vector() {
         let a:number[] = []
         for (let i = 0; i < this.p1.dimension; i++){
-            a.push(this.p2.get(i)-this.p1.get(i))
+            a.push(this.p2.get(i) + this.p1.get(i))
         }
         return a

[NoCoverage] BlockStatement
src/plan.ts:48:47
         return a
     }
 
-    public static scalar(v1:Vector, v2:Vector){
-        if (v1.dimension !== v2.dimension){
-            throw new Error("Vectors dimension need to be the same")
-        }
-
-        let v11 = v1.vector
-        let v22 = v2.vector
-    
-        let a:number = 0
-
-        for (let i = 0; i < v1.dimension; i++){
-            a += v11[i]*v22[i]
-        }
-        return a        
-    }
+    public static scalar(v1:Vector, v2:Vector){}
 }
 

[NoCoverage] BlockStatement
src/plan.ts:49:43
     }
 
     public static scalar(v1:Vector, v2:Vector){
-        if (v1.dimension !== v2.dimension){
-            throw new Error("Vectors dimension need to be the same")
-        }
+        if (v1.dimension !== v2.dimension){}
 
         let v11 = v1.vector

[NoCoverage] ConditionalExpression
src/plan.ts:49:13
     }
 
     public static scalar(v1:Vector, v2:Vector){
-        if (v1.dimension !== v2.dimension){
+        if (true){
             throw new Error("Vectors dimension need to be the same")
         }

[NoCoverage] EqualityOperator
src/plan.ts:58:25
     
         let a:number = 0
 
-        for (let i = 0; i < v1.dimension; i++){
+        for (let i = 0; i <= v1.dimension; i++){
             a += v11[i]*v22[i]
         }

[NoCoverage] UpdateOperator
src/plan.ts:58:43
     
         let a:number = 0
 
-        for (let i = 0; i < v1.dimension; i++){
+        for (let i = 0; i < v1.dimension; i--){
             a += v11[i]*v22[i]
         }

[NoCoverage] ArithmeticOperator
src/plan.ts:59:18
         let a:number = 0
 
         for (let i = 0; i < v1.dimension; i++){
-            a += v11[i]*v22[i]
+            a += v11[i] / v22[i]
         }
         return a        

[NoCoverage] AssignmentOperator
src/plan.ts:59:13
         let a:number = 0
 
         for (let i = 0; i < v1.dimension; i++){
-            a += v11[i]*v22[i]
+            a -= v11[i] * v22[i]
         }
         return a        

[NoCoverage] BlockStatement
src/plan.ts:67:30
 
 export class HyperPlan extends Dimensional {
     constructor ( private points: Point[] ){
-        for (let p of points){
-            if (p.dimension !== points.length){
-                throw new Error("Point dimension needs to match the hyperplan dimension")
-            } 
-        }
+        for (let p of points){}
         super(points.length)
     }

[NoCoverage] BlockStatement
src/plan.ts:68:47
 export class HyperPlan extends Dimensional {
     constructor ( private points: Point[] ){
         for (let p of points){
-            if (p.dimension !== points.length){
-                throw new Error("Point dimension needs to match the hyperplan dimension")
-            } 
+            if (p.dimension !== points.length){} 
         }
         super(points.length)

[NoCoverage] EqualityOperator
src/plan.ts:68:17
 export class HyperPlan extends Dimensional {
     constructor ( private points: Point[] ){
         for (let p of points){
-            if (p.dimension !== points.length){
+            if (p.dimension === points.length){
                 throw new Error("Point dimension needs to match the hyperplan dimension")
             } 

[NoCoverage] ArithmeticOperator
src/plan.ts:76:19
     }
 
     public getParametricEquation() : Equation {
-        let dim = this.dimension + 1
+        let dim = this.dimension - 1
         let m = new EmptyMatrix(dim,dim)
         let identity = new IdentityMatrix(dim,dim)

[NoCoverage] ArithmeticOperator
src/plan.ts:81:27
         let identity = new IdentityMatrix(dim,dim)
         let i,j
         
-        for ( i = 0 ; i < dim-2 ; i ++){
+        for ( i = 0 ; i < dim + 2 ; i ++){
             let  v = new Vector( this.points[dim-2], this.points[i] )
             

[NoCoverage] BlockStatement
src/plan.ts:81:40
         let identity = new IdentityMatrix(dim,dim)
         let i,j
         
-        for ( i = 0 ; i < dim-2 ; i ++){
-            let  v = new Vector( this.points[dim-2], this.points[i] )
-            
-            for (j=0 ; j < dim-1 ; j ++) {
-                m.set(i,j,new Float(v.vector[j]))
-            }
-            m.set(i,j,new Float(1))
-        }
+        for ( i = 0 ; i < dim-2 ; i ++){}
         m.set(i,j-1,new Float(1))
         m.set(i,j,new Float(1))

[NoCoverage] ArithmeticOperator
src/plan.ts:82:46
         let i,j
         
         for ( i = 0 ; i < dim-2 ; i ++){
-            let  v = new Vector( this.points[dim-2], this.points[i] )
+            let  v = new Vector( this.points[dim + 2], this.points[i] )
             
             for (j=0 ; j < dim-1 ; j ++) {

[NoCoverage] EqualityOperator
src/plan.ts:84:24
         for ( i = 0 ; i < dim-2 ; i ++){
             let  v = new Vector( this.points[dim-2], this.points[i] )
             
-            for (j=0 ; j < dim-1 ; j ++) {
+            for (j=0 ; j <= dim - 1 ; j ++) {
                 m.set(i,j,new Float(v.vector[j]))
             }

[NoCoverage] ConditionalExpression
src/plan.ts:84:24
         for ( i = 0 ; i < dim-2 ; i ++){
             let  v = new Vector( this.points[dim-2], this.points[i] )
             
-            for (j=0 ; j < dim-1 ; j ++) {
+            for (j=0 ; false ; j ++) {
                 m.set(i,j,new Float(v.vector[j]))
             }

[NoCoverage] ArithmeticOperator
src/plan.ts:89:17
             }
             m.set(i,j,new Float(1))
         }
-        m.set(i,j-1,new Float(1))
+        m.set(i,j + 1,new Float(1))
         m.set(i,j,new Float(1))
 

[NoCoverage] ArithmeticOperator
src/plan.ts:97:34
 
         let f = Matrix.substract(m2,identity )
         
-        let t = f.extractColumns(dim-1)
+        let t = f.extractColumns(dim + 1)
 
         let teq = []

[NoCoverage] BlockStatement
src/plan.ts:100:43
         let t = f.extractColumns(dim-1)
 
         let teq = []
-        for (let i = 0 ; i < dim - 1; i++){
-            teq.push([new Float(t[i]),new Float(t[dim-1]/3)])
-        }
+        for (let i = 0 ; i < dim - 1; i++){}
 
         let eq = new Matrix(teq)

[NoCoverage] EqualityOperator
src/plan.ts:100:26
         let t = f.extractColumns(dim-1)
 
         let teq = []
-        for (let i = 0 ; i < dim - 1; i++){
+        for (let i = 0 ; i >= dim - 1; i++){
             teq.push([new Float(t[i]),new Float(t[dim-1]/3)])
         }

[NoCoverage] ArithmeticOperator
src/plan.ts:101:49
 
         let teq = []
         for (let i = 0 ; i < dim - 1; i++){
-            teq.push([new Float(t[i]),new Float(t[dim-1]/3)])
+            teq.push([new Float(t[i]),new Float(t[dim - 1] * 3)])
         }
 

[NoCoverage] ArithmeticOperator
src/plan.ts:101:51
 
         let teq = []
         for (let i = 0 ; i < dim - 1; i++){
-            teq.push([new Float(t[i]),new Float(t[dim-1]/3)])
+            teq.push([new Float(t[i]),new Float(t[dim + 1]/3)])
         }
 
