[Killed] BlockStatement
src/complex.ts:7:20
 
     constructor ( public real:Float=new Float(0,1), public imaginary:Float = new Float(0,1)){}
 
-    get conjugue() { 
-        return new Complex(this.real,this.imaginary.opposite())
-    }
+    get conjugue() {}
 
     static multiply(c1 : Complex, c2 : Complex) {
killedBy: Conjugue
statusReason: expected undefined to strictly equal Complex{ real: Float{ …(2) }, …(1) }

[Killed] BlockStatement
src/complex.ts:11:49
         return new Complex(this.real,this.imaginary.opposite())
     }
 
-    static multiply(c1 : Complex, c2 : Complex) {
-        let r = Float.substract(Float.multiply(c1.real,c2.real),Float.multiply(c1.imaginary,c2.imaginary))
-        let i = Float.add(Float.multiply(c1.real,c2.imaginary),Float.multiply(c1.imaginary,c2.real))
-        return new Complex( r, i )
-    }
+    static multiply(c1 : Complex, c2 : Complex) {}
 
     static add(c1 : Complex,c2 :Complex) {
killedBy: multiply
statusReason: expected undefined to strictly equal Complex{ real: Float{ …(2) }, …(1) }

[Killed] BlockStatement
src/complex.ts:17:42
         return new Complex( r, i )
     }
 
-    static add(c1 : Complex,c2 :Complex) {
-        let r = Float.add(c1.real,c2.real)
-        let i = Float.add(c1.imaginary,c2.imaginary)
-        return new Complex( r, i )
-    }
+    static add(c1 : Complex,c2 :Complex) {}
 
     static substract(c1 : Complex,c2 :Complex) {
killedBy: add
statusReason: expected undefined to strictly equal Complex{ real: Float{ …(2) }, …(1) }

[Survived] BlockStatement
src/complex.ts:23:48
         return new Complex( r, i )
     }
 
-    static substract(c1 : Complex,c2 :Complex) {
-        let r = Float.substract(c1.real,c2.real)
-        let i = Float.substract(c1.imaginary,c2.imaginary)
-        return new Complex( r, i )
-    }
+    static substract(c1 : Complex,c2 :Complex) {}
 
     isReal(){

[Killed] BlockStatement
src/complex.ts:29:13
         return new Complex( r, i )
     }
 
-    isReal(){
-        return this.imaginary.toNumber() === 0
-    }
+    isReal(){}
 
     isImaginary(){
killedBy: Complex(1,1) is not real and imaginary
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:30:16
     }
 
     isReal(){
-        return this.imaginary.toNumber() === 0
+        return true
     }
 
killedBy: Complex(1,1) is not real and imaginary
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/complex.ts:30:16
     }
 
     isReal(){
-        return this.imaginary.toNumber() === 0
+        return this.imaginary.toNumber() !== 0
     }
 
killedBy: Complex(1,1) is not real and imaginary
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/complex.ts:33:18
         return this.imaginary.toNumber() === 0
     }
 
-    isImaginary(){
-        return this.real.toNumber() === 0
-    }
+    isImaginary(){}
 
     toString() {
killedBy: Complex(1,1) is not real and imaginary
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/complex.ts:34:16
     }
 
     isImaginary(){
-        return this.real.toNumber() === 0
+        return this.real.toNumber() !== 0
     }
 
killedBy: Complex(1,1) is not real and imaginary
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:34:16
     }
 
     isImaginary(){
-        return this.real.toNumber() === 0
+        return false
     }
 
killedBy: Complex(0,1) is imaginary
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/complex.ts:37:16
         return this.real.toNumber() === 0
     }
 
-    toString() {
-
-        let a = parseFloat(this.real.toNumber().toFixed(4))
-        let b = parseFloat(this.imaginary.toNumber().toFixed(4))
-        let sb = b < 0 ? '-' : '+'
-
-        if (b==0){
-            return `${a}`
-        }
-        else if (a==0){
-            return `${b}i`
-        }
-
-        return `${a}${sb}${Math.abs(b)}i`
-    }
+    toString() {}
 
 }
killedBy: toString
statusReason: expected undefined to be '1-1i' // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:41:18
 
         let a = parseFloat(this.real.toNumber().toFixed(4))
         let b = parseFloat(this.imaginary.toNumber().toFixed(4))
-        let sb = b < 0 ? '-' : '+'
+        let sb = false ? '-' : '+'
 
         if (b==0){
killedBy: toString
statusReason: expected '1+1i' to be '1-1i' // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:41:18
 
         let a = parseFloat(this.real.toNumber().toFixed(4))
         let b = parseFloat(this.imaginary.toNumber().toFixed(4))
-        let sb = b < 0 ? '-' : '+'
+        let sb = true ? '-' : '+'
 
         if (b==0){
killedBy: toString
statusReason: expected '1-1i' to be '1+1i' // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:43:13
         let b = parseFloat(this.imaginary.toNumber().toFixed(4))
         let sb = b < 0 ? '-' : '+'
 
-        if (b==0){
+        if (false){
             return `${a}`
         }
killedBy: toString
statusReason: expected '-1+0i' to be '-1' // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:43:13
         let b = parseFloat(this.imaginary.toNumber().toFixed(4))
         let sb = b < 0 ? '-' : '+'
 
-        if (b==0){
+        if (true){
             return `${a}`
         }
killedBy: toString
statusReason: expected '1' to be '1-1i' // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:46:18
         if (b==0){
             return `${a}`
         }
-        else if (a==0){
+        else if (false){
             return `${b}i`
         }
killedBy: toString
statusReason: expected '0-1i' to be '-1i' // Object.is equality

[Killed] ConditionalExpression
src/complex.ts:46:18
         if (b==0){
             return `${a}`
         }
-        else if (a==0){
+        else if (true){
             return `${b}i`
         }
killedBy: toString
statusReason: expected '-1i' to be '1-1i' // Object.is equality

[Killed] StringLiteral
src/complex.ts:47:20
             return `${a}`
         }
         else if (a==0){
-            return `${b}i`
+            return ``
         }
 
killedBy: toString
statusReason: expected '' to be '-1i' // Object.is equality
