[Killed] BlockStatement
src/arithmetic.ts:1:40
-export function pgcd(p:number,q:number){
-    while (q !== 0) {
-        let t = q
-        q = p%q
-        p = t
-    }
-    return p
-}
+export function pgcd(p:number,q:number){}
killedBy: Complex(1,0) is real
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/arithmetic.ts:2:12
 export function pgcd(p:number,q:number){
-    while (q !== 0) {
+    while (false) {
         let t = q
         q = p%q
killedBy: CpxTab
statusReason: expected '[ 1+NaNi 2+NaNi 3+NaNi 4+NaNi ]' to be '[ 1 2 3 4 ]' // Object.is equality

[Killed] EqualityOperator
src/arithmetic.ts:2:12
 export function pgcd(p:number,q:number){
-    while (q !== 0) {
+    while (q === 0) {
         let t = q
         q = p%q
killedBy: Eq retrieve y
statusReason: expected Float{ numerateur: NaN, …(1) } to strictly equal Float{ numerateur: 1, …(1) }

[Timeout] ArithmeticOperator
src/arithmetic.ts:4:13
 export function pgcd(p:number,q:number){
     while (q !== 0) {
         let t = q
-        q = p%q
+        q = p * q
         p = t
     }
