[Killed] EqualityOperator
src/fft.ts:13:13
     }
 
     load (x:Float[]){
-        if (x.length > this.tab.length){
+        if (x.length <= this.tab.length){
             throw new Error("le tableau à charger doit être plus petit ou égal à la taille du tableau Complex")
         }
killedBy: Eq1
statusReason: le tableau à charger doit être plus petit ou égal à la taille du tableau Complex

[Killed] EqualityOperator
src/fft.ts:40:26
 
     conjugue() {
         let newTab = new CpxTab(this.taille())
-        for (let i = 0 ; i < this.taille() ; i++){
+        for (let i = 0 ; i <= this.taille() ; i++){
             newTab.set(i,this.get(i).conjugue) 
         }
killedBy: Eq1
statusReason: Cannot read properties of undefined (reading 'conjugue')

[Killed] UpdateOperator
src/fft.ts:48:44
 
     static multiply(c1: CpxTab, c2 : CpxTab) {
         let newTab = new CpxTab(c1.taille())
-        for (let i = 0 ; i < c1.taille() ; i++){
+        for (let i = 0 ; i < c1.taille() ; i--){
             newTab.set(i,Complex.multiply( c1.get(i), c2.get(i) ))
         }
killedBy: Eq1
statusReason: Cannot read properties of undefined (reading 'real')

[Killed] ConditionalExpression
src/fft.ts:57:9
 
 export function fftCombine(c1 : CpxTab , c2 : CpxTab ) : CpxTab {
 
-    if (c1.taille() != c2.taille()){
+    if (true){
         throw new Error(`combine: c1 et c2 ne sont pas de même taille, taille c1=${c1.taille()} taille c2=${c2.taille()}`)
     }
killedBy: Eq1
statusReason: combine: c1 et c2 ne sont pas de même taille, taille c1=1 taille c2=1

[Killed] UpdateOperator
src/fft.ts:66:28
 
     let retour = new CpxTab(m*2);
 
-    for (let k = 0; k < m; k++){
+    for (let k = 0; k < m; k--){
 
         let Wnr = Math.cos( 2 * Math.PI / n * k )
killedBy: Eq1
statusReason: Cannot read properties of undefined (reading 'real')

[Killed] EqualityOperator
src/fft.ts:85:14
     let n = x.taille();
 
     if (n==1){return x;}
-    else if (n % 2 !== 0){
+    else if (n % 2 === 0){
         throw new Error(`FFT: la taille de x doit être une puissance de 2`)
     }
killedBy: Eq1
statusReason: FFT: la taille de x doit être une puissance de 2
