[Killed] ArithmeticOperator
src/float.ts:38:26
     }
 
     static add(f1:Float, f2:Float){
-        return new Float(f2.numerateur*f1.denominateur + f1.numerateur*f2.denominateur,f2.denominateur*f1.denominateur)
+        return new Float(f2.numerateur * f1.denominateur - f1.numerateur * f2.denominateur,f2.denominateur*f1.denominateur)
     }
 
killedBy: 2/7 + 3/5  = 31/35
statusReason: expected Float{ numerateur: 11, …(1) } to strictly equal Float{ numerateur: 31, …(1) }
