[Killed] EqualityOperator
src/matrix.ts:5:41
 class Size{
     constructor(public lines:number, public columns:number) {}
     static equals(s1:Size,s2:Size){
-        return s1.lines === s2.lines && s2.columns === s1.columns
+        return s1.lines === s2.lines && s2.columns !== s1.columns
     }
     toString() {
killedBy: Sum
statusReason: Matrix must be of same dimensions

[Survived] BlockStatement
src/matrix.ts:13:43
 }
 
 export class Matrix{
-    constructor(private list: number[][]) {
-        let s = list[0].length;
-        for (let i = 1; i < list.length; i++) {
-            if (s!==list[i].length) {
-                throw "It is not a matrix"
-            }
-        }
-    }
+    constructor(private list: number[][]) {}
 
     public get_matrix():number[][]{

[Survived] ConditionalExpression
src/matrix.ts:15:25
 export class Matrix{
     constructor(private list: number[][]) {
         let s = list[0].length;
-        for (let i = 1; i < list.length; i++) {
+        for (let i = 1; false; i++) {
             if (s!==list[i].length) {
                 throw "It is not a matrix"

[Survived] ConditionalExpression
src/matrix.ts:16:17
     constructor(private list: number[][]) {
         let s = list[0].length;
         for (let i = 1; i < list.length; i++) {
-            if (s!==list[i].length) {
+            if (false) {
                 throw "It is not a matrix"
             }

[Survived] EqualityOperator
src/matrix.ts:16:17
     constructor(private list: number[][]) {
         let s = list[0].length;
         for (let i = 1; i < list.length; i++) {
-            if (s!==list[i].length) {
+            if (s === list[i].length) {
                 throw "It is not a matrix"
             }

[NoCoverage] StringLiteral
src/matrix.ts:17:23
         let s = list[0].length;
         for (let i = 1; i < list.length; i++) {
             if (s!==list[i].length) {
-                throw "It is not a matrix"
+                throw ""
             }
         }

[Killed] BlockStatement
src/matrix.ts:22:35
         }
     }
 
-    public get_matrix():number[][]{
-        return this.list;
-    }
+    public get_matrix():number[][]{}
 
     public dimensions(): Size {
killedBy: Identity
statusReason: expected undefined to strictly equal [ [ 1, +0, +0 ], [ +0, 1, +0 ] ]

[Killed] BlockStatement
src/matrix.ts:30:43
         return new Size(this.list.length,this.list[0].length);
     }
 
-    public get(i:number,j:number): number {
-        let dims = this.dimensions();
-        if (!(i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)) {
-            throw `Out of bounds ${i} ${j} ${dims.toString()}`;
-        }
-        return this.list[i][j];
-    }
+    public get(i:number,j:number): number {}
 
     public set(i:number,j:number, value:number) {
killedBy: Inverse
statusReason: expected [ [ NaN, NaN ], [ NaN, NaN ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Survived] EqualityOperator
src/matrix.ts:32:35
 
     public get(i:number,j:number): number {
         let dims = this.dimensions();
-        if (!(i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)) {
+        if (!(i >= 0 && j >= 0 && i <= dims.lines && j < dims.columns)) {
             throw `Out of bounds ${i} ${j} ${dims.toString()}`;
         }

[Survived] ConditionalExpression
src/matrix.ts:32:13
 
     public get(i:number,j:number): number {
         let dims = this.dimensions();
-        if (!(i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)) {
+        if (true) {
             throw `Out of bounds ${i} ${j} ${dims.toString()}`;
         }

[Killed] BlockStatement
src/matrix.ts:38:49
         return this.list[i][j];
     }
 
-    public set(i:number,j:number, value:number) {
-        let dims = this.dimensions();
-        if (!(i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)) {
-            throw `Out of bounds ${i} ${j} ${dims.toString()}`;
-        }
-        this.list[i][j] = value
-    }
+    public set(i:number,j:number, value:number) {}
 
     public static add(m1:Matrix,m2:Matrix){
killedBy: Inverse
statusReason: expected [ [ 1, +0 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Survived] EqualityOperator
src/matrix.ts:40:35
 
     public set(i:number,j:number, value:number) {
         let dims = this.dimensions();
-        if (!(i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)) {
+        if (!(i >= 0 && j >= 0 && i >= dims.lines && j < dims.columns)) {
             throw `Out of bounds ${i} ${j} ${dims.toString()}`;
         }

[Survived] EqualityOperator
src/matrix.ts:40:53
 
     public set(i:number,j:number, value:number) {
         let dims = this.dimensions();
-        if (!(i >= 0 && j >= 0 && i < dims.lines && j < dims.columns)) {
+        if (!(i >= 0 && j >= 0 && i < dims.lines && j >= dims.columns)) {
             throw `Out of bounds ${i} ${j} ${dims.toString()}`;
         }

[Killed] BlockStatement
src/matrix.ts:46:43
         this.list[i][j] = value
     }
 
-    public static add(m1:Matrix,m2:Matrix){
-        if (!Size.equals(m1.dimensions(),m2.dimensions())) {
-            throw "Matrix must be of same dimensions";
-        }
-
-        let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
-
-        for (let i = 0; i < m1.dimensions().lines; i++) {
-            for (let j = 0; j < m1.dimensions().columns; j++) {
-                return_class.set(i,j, m1.list[i][j] + m2.list[i][j] )
-            }
-        }
-        return return_class;
-    }
+    public static add(m1:Matrix,m2:Matrix){}
 
 
killedBy: Sum
statusReason: Cannot read properties of undefined (reading 'get_matrix')

[Killed] BlockStatement
src/matrix.ts:53:57
 
         let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
 
-        for (let i = 0; i < m1.dimensions().lines; i++) {
-            for (let j = 0; j < m1.dimensions().columns; j++) {
-                return_class.set(i,j, m1.list[i][j] + m2.list[i][j] )
-            }
-        }
+        for (let i = 0; i < m1.dimensions().lines; i++) {}
         return return_class;
     }
killedBy: Sum
statusReason: expected [ [ +0, +0 ], [ +0, +0 ] ] to strictly equal [ [ 2, +0 ], [ +0, 2 ] ]

[Killed] EqualityOperator
src/matrix.ts:54:29
         let return_class = new EmptyMatrix(m1.dimensions().lines,m1.dimensions().columns)
 
         for (let i = 0; i < m1.dimensions().lines; i++) {
-            for (let j = 0; j < m1.dimensions().columns; j++) {
+            for (let j = 0; j <= m1.dimensions().columns; j++) {
                 return_class.set(i,j, m1.list[i][j] + m2.list[i][j] )
             }
killedBy: Sum
statusReason: Out of bounds 0 2 {2, 2}

[Killed] ArithmeticOperator
src/matrix.ts:55:39
 
         for (let i = 0; i < m1.dimensions().lines; i++) {
             for (let j = 0; j < m1.dimensions().columns; j++) {
-                return_class.set(i,j, m1.list[i][j] + m2.list[i][j] )
+                return_class.set(i,j, m1.list[i][j] - m2.list[i][j] )
             }
         }
killedBy: Sum
statusReason: expected [ [ +0, 4 ], [ +0, +0 ] ] to strictly equal [ [ 2, +0 ], [ +0, 2 ] ]

[Killed] BlockStatement
src/matrix.ts:62:48
     }
 
 
-    public static multiply(m1:Matrix,m2:Matrix){
-        if (m1.dimensions().columns !== m2.dimensions().lines) {
-            throw "Matrix must be multiply-able";
-        }
-
-        let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
-
-        for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
-                let value = 0
-
-                for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value += m1.get(i,k) * m2.get(k,j);
-                }
-
-                return_class.set(i,j, value)
-            }
-        }
-
-        return return_class;
-    }
+    public static multiply(m1:Matrix,m2:Matrix){}
 
     public operate_by(f:Function){
killedBy: Multiplication
statusReason: Cannot read properties of undefined (reading 'get_matrix')

[NoCoverage] StringLiteral
src/matrix.ts:64:19
 
     public static multiply(m1:Matrix,m2:Matrix){
         if (m1.dimensions().columns !== m2.dimensions().lines) {
-            throw "Matrix must be multiply-able";
+            throw "";
         }
 

[Killed] BlockStatement
src/matrix.ts:69:67
 
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
-        for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
-                let value = 0
-
-                for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value += m1.get(i,k) * m2.get(k,j);
-                }
-
-                return_class.set(i,j, value)
-            }
-        }
+        for (let i = 0; i < return_class.dimensions().lines; i++) {}
 
         return return_class;
killedBy: Multiplication
statusReason: expected [ [ +0, +0 ], [ +0, +0 ] ] to strictly equal [ [ 1, +0 ], [ +0, 1 ] ]

[Killed] EqualityOperator
src/matrix.ts:69:25
 
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
-        for (let i = 0; i < return_class.dimensions().lines; i++) {
+        for (let i = 0; i >= return_class.dimensions().lines; i++) {
             for (let j = 0; j < return_class.dimensions().columns; j++) {
                 let value = 0
killedBy: Multiplication
statusReason: expected [ [ +0, +0 ], [ +0, +0 ] ] to strictly equal [ [ 1, +0 ], [ +0, 1 ] ]

[Killed] ConditionalExpression
src/matrix.ts:70:29
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
         for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
+            for (let j = 0; false; j++) {
                 let value = 0
 
killedBy: Multiplication
statusReason: expected [ [ +0, +0 ], [ +0, +0 ] ] to strictly equal [ [ 1, +0 ], [ +0, 1 ] ]

[Killed] BlockStatement
src/matrix.ts:70:73
         let return_class = new EmptyMatrix(m1.dimensions().lines,m2.dimensions().columns)
 
         for (let i = 0; i < return_class.dimensions().lines; i++) {
-            for (let j = 0; j < return_class.dimensions().columns; j++) {
-                let value = 0
-
-                for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value += m1.get(i,k) * m2.get(k,j);
-                }
-
-                return_class.set(i,j, value)
-            }
+            for (let j = 0; j < return_class.dimensions().columns; j++) {}
         }
 
killedBy: Multiplication
statusReason: expected [ [ +0, +0 ], [ +0, +0 ] ] to strictly equal [ [ 1, +0 ], [ +0, 1 ] ]

[Killed] UpdateOperator
src/matrix.ts:73:62
             for (let j = 0; j < return_class.dimensions().columns; j++) {
                 let value = 0
 
-                for (let k = 0; k < m1.dimensions().columns; k++) {
+                for (let k = 0; k < m1.dimensions().columns; k--) {
                     value += m1.get(i,k) * m2.get(k,j);
                 }
killedBy: Multiplication
statusReason: Out of bounds 0 -1 {2, 2}

[Killed] BlockStatement
src/matrix.ts:73:67
             for (let j = 0; j < return_class.dimensions().columns; j++) {
                 let value = 0
 
-                for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value += m1.get(i,k) * m2.get(k,j);
-                }
+                for (let k = 0; k < m1.dimensions().columns; k++) {}
 
                 return_class.set(i,j, value)
killedBy: Multiplication
statusReason: expected [ [ +0, +0 ], [ +0, +0 ] ] to strictly equal [ [ 1, +0 ], [ +0, 1 ] ]

[Killed] ArithmeticOperator
src/matrix.ts:74:30
                 let value = 0
 
                 for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value += m1.get(i,k) * m2.get(k,j);
+                    value += m1.get(i, k) / m2.get(k, j);
                 }
 
killedBy: Multiplication
statusReason: expected [ [ Infinity, 1.5 ], [ Infinity, 1 ] ] to strictly equal [ [ 1, +0 ], [ +0, 1 ] ]

[Killed] AssignmentOperator
src/matrix.ts:74:21
                 let value = 0
 
                 for (let k = 0; k < m1.dimensions().columns; k++) {
-                    value += m1.get(i,k) * m2.get(k,j);
+                    value -= m1.get(i, k) * m2.get(k, j);
                 }
 
killedBy: Multiplication
statusReason: expected [ [ -1, +0 ], [ +0, -1 ] ] to strictly equal [ [ 1, +0 ], [ +0, 1 ] ]

[NoCoverage] EqualityOperator
src/matrix.ts:85:25
     }
 
     public operate_by(f:Function){
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; i <= this.dimensions().lines; i++) {
             for (let j = 0; j < this.dimensions().columns; j++) {
                 this.set(i,j, f(this.get(i,j)));

[NoCoverage] BlockStatement
src/matrix.ts:86:65
 
     public operate_by(f:Function){
         for (let i = 0; i < this.dimensions().lines; i++) {
-            for (let j = 0; j < this.dimensions().columns; j++) {
-                this.set(i,j, f(this.get(i,j)));
-            }
+            for (let j = 0; j < this.dimensions().columns; j++) {}
         }
     }

[Survived] EqualityOperator
src/matrix.ts:93:25
     }
 
     public operate_line_by(f:Function,i:number){
-        for (let j = 0; j < this.dimensions().columns; j++) {
+        for (let j = 0; j <= this.dimensions().columns; j++) {
             this.set(i,j, f(this.get(i,j)));
         }

[NoCoverage] EqualityOperator
src/matrix.ts:99:25
     }
 
     public operate_column_by(f:Function,j:number){
-        for (let i = 0; i < this.dimensions().lines; i++) {
+        for (let i = 0; i >= this.dimensions().lines; i++) {
             this.set(i,j, f(this.get(i,j)));
         }

[Killed] BlockStatement
src/matrix.ts:134:52
             let k = 0
             let max = -Infinity
 
-            for (let i = r+1; i < dims.lines; i++) {
-                if (m.get(i,j) >= max) {
-                    k = i
-                    max = m.get(i,j)
-                }
-            }
+            for (let i = r+1; i < dims.lines; i++) {}
 
             let coef = m.get(k,j)
killedBy: Inverse
statusReason: expected [ [ -0.5, 1 ], [ 0.5, +0 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] ConditionalExpression
src/matrix.ts:134:31
             let k = 0
             let max = -Infinity
 
-            for (let i = r+1; i < dims.lines; i++) {
+            for (let i = r+1; false; i++) {
                 if (m.get(i,j) >= max) {
                     k = i
killedBy: Inverse
statusReason: expected [ [ -0.5, 1 ], [ 0.5, +0 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] ConditionalExpression
src/matrix.ts:135:21
             let max = -Infinity
 
             for (let i = r+1; i < dims.lines; i++) {
-                if (m.get(i,j) >= max) {
+                if (false) {
                     k = i
                     max = m.get(i,j)
killedBy: Inverse
statusReason: expected [ [ -0.5, 1 ], [ 0.5, +0 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] ConditionalExpression
src/matrix.ts:135:21
             let max = -Infinity
 
             for (let i = r+1; i < dims.lines; i++) {
-                if (m.get(i,j) >= max) {
+                if (true) {
                     k = i
                     max = m.get(i,j)
killedBy: Inverse
statusReason: expected [ [ +0, 1 ], [ 1, -2 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] EqualityOperator
src/matrix.ts:142:17
             }
 
             let coef = m.get(k,j)
-            if (coef !== 0) {
+            if (coef === 0) {
                 r++
                 m.operate_line_by((n:number)=>{return n/coef},k)
killedBy: Inverse
statusReason: expected [ [ 1, +0 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] BlockStatement
src/matrix.ts:142:29
             }
 
             let coef = m.get(k,j)
-            if (coef !== 0) {
-                r++
-                m.operate_line_by((n:number)=>{return n/coef},k)
-                return_matrix.operate_line_by((n:number)=>{return n/coef},k)
-
-                if (k!==r){
-                    m.swap_lines(k,r)
-                    return_matrix.swap_lines(k,r)
-                }
-                for (let i = 0; i < dims.lines; i++) {
-                    let coef2 = m.get(i,j)
-                    if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
-                            return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
-
-                            m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
-                        }
-                    }
-                }
-            }
+            if (coef !== 0) {}
         }
 
killedBy: Inverse
statusReason: expected [ [ 1, +0 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Survived] UpdateOperator
src/matrix.ts:143:17
 
             let coef = m.get(k,j)
             if (coef !== 0) {
-                r++
+                r--
                 m.operate_line_by((n:number)=>{return n/coef},k)
                 return_matrix.operate_line_by((n:number)=>{return n/coef},k)

[Killed] BlockStatement
src/matrix.ts:144:47
             let coef = m.get(k,j)
             if (coef !== 0) {
                 r++
-                m.operate_line_by((n:number)=>{return n/coef},k)
+                m.operate_line_by((n:number)=>{},k)
                 return_matrix.operate_line_by((n:number)=>{return n/coef},k)
 
killedBy: Inverse
statusReason: expected [ [ NaN, NaN ], [ NaN, NaN ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Survived] ArithmeticOperator
src/matrix.ts:144:55
             let coef = m.get(k,j)
             if (coef !== 0) {
                 r++
-                m.operate_line_by((n:number)=>{return n/coef},k)
+                m.operate_line_by((n:number)=>{return n * coef},k)
                 return_matrix.operate_line_by((n:number)=>{return n/coef},k)
 

[Killed] BlockStatement
src/matrix.ts:145:59
             if (coef !== 0) {
                 r++
                 m.operate_line_by((n:number)=>{return n/coef},k)
-                return_matrix.operate_line_by((n:number)=>{return n/coef},k)
+                return_matrix.operate_line_by((n:number)=>{},k)
 
                 if (k!==r){
killedBy: Inverse
statusReason: expected [ [ NaN, NaN ], …(1) ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Survived] ArithmeticOperator
src/matrix.ts:145:67
             if (coef !== 0) {
                 r++
                 m.operate_line_by((n:number)=>{return n/coef},k)
-                return_matrix.operate_line_by((n:number)=>{return n/coef},k)
+                return_matrix.operate_line_by((n:number)=>{return n * coef},k)
 
                 if (k!==r){

[Survived] ConditionalExpression
src/matrix.ts:147:21
                 m.operate_line_by((n:number)=>{return n/coef},k)
                 return_matrix.operate_line_by((n:number)=>{return n/coef},k)
 
-                if (k!==r){
+                if (true){
                     m.swap_lines(k,r)
                     return_matrix.swap_lines(k,r)

[Killed] BlockStatement
src/matrix.ts:151:54
                     m.swap_lines(k,r)
                     return_matrix.swap_lines(k,r)
                 }
-                for (let i = 0; i < dims.lines; i++) {
-                    let coef2 = m.get(i,j)
-                    if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
-                            return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
-
-                            m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
-                        }
-                    }
-                }
+                for (let i = 0; i < dims.lines; i++) {}
             }
         }
killedBy: Inverse
statusReason: expected [ [ 1, +0 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] ConditionalExpression
src/matrix.ts:151:33
                     m.swap_lines(k,r)
                     return_matrix.swap_lines(k,r)
                 }
-                for (let i = 0; i < dims.lines; i++) {
+                for (let i = 0; false; i++) {
                     let coef2 = m.get(i,j)
                     if (i!==r){
killedBy: Inverse
statusReason: expected [ [ 1, +0 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] BlockStatement
src/matrix.ts:153:31
                 }
                 for (let i = 0; i < dims.lines; i++) {
                     let coef2 = m.get(i,j)
-                    if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
-                            return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
-
-                            m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
-                        }
-                    }
+                    if (i!==r){}
                 }
             }
killedBy: Inverse
statusReason: expected [ [ 1, +0 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] BlockStatement
src/matrix.ts:154:59
                 for (let i = 0; i < dims.lines; i++) {
                     let coef2 = m.get(i,j)
                     if (i!==r){
-                        for (let o=0;o<dims.columns; o++) {
-                            return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
-
-                            m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
-                        }
+                        for (let o=0;o<dims.columns; o++) {}
                     }
                 }
killedBy: Inverse
statusReason: expected [ [ 1, +0 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] ArithmeticOperator
src/matrix.ts:155:51
                     let coef2 = m.get(i,j)
                     if (i!==r){
                         for (let o=0;o<dims.columns; o++) {
-                            return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
+                            return_matrix.set(i,o,return_matrix.get(i, o) + coef2 * return_matrix.get(r, o))
 
                             m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
killedBy: Inverse
statusReason: expected [ [ 1, 2 ], [ +0, 1 ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Killed] ArithmeticOperator
src/matrix.ts:155:74
                     let coef2 = m.get(i,j)
                     if (i!==r){
                         for (let o=0;o<dims.columns; o++) {
-                            return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
+                            return_matrix.set(i,o,return_matrix.get(i,o)-coef2 / return_matrix.get(r, o))
 
                             m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
killedBy: Inverse
statusReason: expected [ [ -Infinity, NaN ], [ +0, NaN ] ] to strictly equal [ [ 1, -2 ], [ +0, 1 ] ]

[Survived] ArithmeticOperator
src/matrix.ts:157:39
                         for (let o=0;o<dims.columns; o++) {
                             return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
 
-                            m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
+                            m.set(i,o,m.get(i, o) + coef2 * m.get(r, o))
                         }
                     }

[Survived] ArithmeticOperator
src/matrix.ts:157:50
                         for (let o=0;o<dims.columns; o++) {
                             return_matrix.set(i,o,return_matrix.get(i,o)-coef2*return_matrix.get(r,o))
 
-                            m.set(i,o,m.get(i,o)-coef2*m.get(r,o))
+                            m.set(i,o,m.get(i,o)-coef2 / m.get(r, o))
                         }
                     }

[Survived] BlockStatement
src/matrix.ts:169:41
 }
 
 export class EmptyMatrix extends Matrix{
-    constructor(l : number, c : number) {
-        let list:number[][]=[]
-
-        for (let i = 0; i < l; i++) {
-            list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(0);
-            }
-        }
-
-        super(list)
-    }
+    constructor(l : number, c : number) {}
 }
 

[Survived] ArrayDeclaration
src/matrix.ts:170:29
 
 export class EmptyMatrix extends Matrix{
     constructor(l : number, c : number) {
-        let list:number[][]=[]
+        let list:number[][]=["Stryker was here"]
 
         for (let i = 0; i < l; i++) {

[Survived] UpdateOperator
src/matrix.ts:172:32
     constructor(l : number, c : number) {
         let list:number[][]=[]
 
-        for (let i = 0; i < l; i++) {
+        for (let i = 0; i < l; i--) {
             list.push([]);
             for (let j = 0; j < c; j++) {

[Survived] BlockStatement
src/matrix.ts:174:41
 
         for (let i = 0; i < l; i++) {
             list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(0);
-            }
+            for (let j = 0; j < c; j++) {}
         }
 

[Survived] BlockStatement
src/matrix.ts:184:41
 }
 
 export class IdentityMatrix extends Matrix{
-    constructor(l : number, c : number) {
-        let list:number[][]=[]
-
-        for (let i = 0; i < l; i++) {
-            list.push([]);
-            for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? 1 : 0);
-            }
-        }
-
-        super(list)
-    }
+    constructor(l : number, c : number) {}
 }
 

[Survived] ConditionalExpression
src/matrix.ts:187:25
     constructor(l : number, c : number) {
         let list:number[][]=[]
 
-        for (let i = 0; i < l; i++) {
+        for (let i = 0; false; i++) {
             list.push([]);
             for (let j = 0; j < c; j++) {

[Survived] EqualityOperator
src/matrix.ts:189:29
 
         for (let i = 0; i < l; i++) {
             list.push([]);
-            for (let j = 0; j < c; j++) {
+            for (let j = 0; j >= c; j++) {
                 list[i].push(i===j ? 1 : 0);
             }

[Killed] ConditionalExpression
src/matrix.ts:190:30
         for (let i = 0; i < l; i++) {
             list.push([]);
             for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? 1 : 0);
+                list[i].push(true ? 1 : 0);
             }
         }
killedBy: Identity
statusReason: expected [ [ 1, 1, 1 ], [ 1, 1, 1 ] ] to strictly equal [ [ 1, +0, +0 ], [ +0, 1, +0 ] ]

[Killed] ConditionalExpression
src/matrix.ts:190:30
         for (let i = 0; i < l; i++) {
             list.push([]);
             for (let j = 0; j < c; j++) {
-                list[i].push(i===j ? 1 : 0);
+                list[i].push(false ? 1 : 0);
             }
         }
killedBy: Identity
statusReason: expected [ [ +0, +0, +0 ], [ +0, +0, +0 ] ] to strictly equal [ [ 1, +0, +0 ], [ +0, 1, +0 ] ]

[Killed] BlockStatement
src/matrix.ts:199:43
 }
 
 export class PolynomeMatrix extends Matrix{
-    constructor(l : number[], c : number) {
-        let list:number[][]=[]
-
-        for (let i = 0; i < l.length; i++) {
-            list.push([]);
-            for (let j = c; j >= 0; j--) {
-                list[i].push(l[i]**j);
-            }
-        }
-        super(list)
-    }
+    constructor(l : number[], c : number) {}
 }
 
killedBy: Polynome
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] ArrayDeclaration
src/matrix.ts:200:29
 
 export class PolynomeMatrix extends Matrix{
     constructor(l : number[], c : number) {
-        let list:number[][]=[]
+        let list:number[][]=["Stryker was here"]
 
         for (let i = 0; i < l.length; i++) {
killedBy: Polynome
statusReason: list[i].push is not a function

[Killed] UpdateOperator
src/matrix.ts:202:39
     constructor(l : number[], c : number) {
         let list:number[][]=[]
 
-        for (let i = 0; i < l.length; i++) {
+        for (let i = 0; i < l.length; i--) {
             list.push([]);
             for (let j = c; j >= 0; j--) {
killedBy: Polynome
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] EqualityOperator
src/matrix.ts:202:25
     constructor(l : number[], c : number) {
         let list:number[][]=[]
 
-        for (let i = 0; i < l.length; i++) {
+        for (let i = 0; i <= l.length; i++) {
             list.push([]);
             for (let j = c; j >= 0; j--) {
killedBy: Polynome
statusReason: expected [ [ 8, 4, 2, 1 ], …(2) ] to strictly equal [ [ 8, 4, 2, 1 ], [ 27, 9, 3, 1 ] ]

[Killed] EqualityOperator
src/matrix.ts:204:29
 
         for (let i = 0; i < l.length; i++) {
             list.push([]);
-            for (let j = c; j >= 0; j--) {
+            for (let j = c; j < 0; j--) {
                 list[i].push(l[i]**j);
             }
killedBy: Polynome
statusReason: expected [ [], [] ] to strictly equal [ [ 8, 4, 2, 1 ], [ 27, 9, 3, 1 ] ]

[Killed] BlockStatement
src/matrix.ts:204:42
 
         for (let i = 0; i < l.length; i++) {
             list.push([]);
-            for (let j = c; j >= 0; j--) {
-                list[i].push(l[i]**j);
-            }
+            for (let j = c; j >= 0; j--) {}
         }
         super(list)
killedBy: Polynome
statusReason: expected [ [], [] ] to strictly equal [ [ 8, 4, 2, 1 ], [ 27, 9, 3, 1 ] ]
