[NoCoverage] BlockStatement
src/plan.ts:15:23
         return this.c[i]
     }
 
-    substract(p:Point){
-        if (p.dimension !== this.dimension){
-            throw new Error("Points dimension need to be the same")
-        }
-
-        let a:number[] = []
-        for (let i = 0; i < this.dimension; i++){
-            a.push(this.get(i)-p.get(i))
-        }
-        return new Point(a) 
-    }
+    substract(p:Point){}
 }
 

[NoCoverage] EqualityOperator
src/plan.ts:16:13
     }
 
     substract(p:Point){
-        if (p.dimension !== this.dimension){
+        if (p.dimension === this.dimension){
             throw new Error("Points dimension need to be the same")
         }

[NoCoverage] BlockStatement
src/plan.ts:16:44
     }
 
     substract(p:Point){
-        if (p.dimension !== this.dimension){
-            throw new Error("Points dimension need to be the same")
-        }
+        if (p.dimension !== this.dimension){}
 
         let a:number[] = []

[NoCoverage] EqualityOperator
src/plan.ts:21:25
         }
 
         let a:number[] = []
-        for (let i = 0; i < this.dimension; i++){
+        for (let i = 0; i >= this.dimension; i++){
             a.push(this.get(i)-p.get(i))
         }

[NoCoverage] BlockStatement
src/plan.ts:21:49
         }
 
         let a:number[] = []
-        for (let i = 0; i < this.dimension; i++){
-            a.push(this.get(i)-p.get(i))
-        }
+        for (let i = 0; i < this.dimension; i++){}
         return new Point(a) 
     }

[NoCoverage] ArithmeticOperator
src/plan.ts:22:20
 
         let a:number[] = []
         for (let i = 0; i < this.dimension; i++){
-            a.push(this.get(i)-p.get(i))
+            a.push(this.get(i) + p.get(i))
         }
         return new Point(a) 

[NoCoverage] EqualityOperator
src/plan.ts:30:13
 
 export class Vector extends Dimensional{
     constructor ( private p1, private p2 ){
-        if (p1.dimension !== p2.dimension){
+        if (p1.dimension === p2.dimension){
             throw new Error("Points dimension need to be the same")
         }

[NoCoverage] ArrayDeclaration
src/plan.ts:37:26
     }
 
     get vector() {
-        let a:number[] = []
+        let a:number[] = ["Stryker was here"]
         for (let i = 0; i < this.p1.dimension; i++){
             a.push(this.p2.get(i)-this.p1.get(i))

[NoCoverage] BlockStatement
src/plan.ts:44:28
         return a
     }
 
-    public scalar(v:Vector){
-        if (v.dimension !== this.dimension){
-            throw new Error("Vectors dimension need to be the same")
-        }
-
-        let v1 = this.vector
-        let v2 = v.vector
-    
-        let a:number = 0
-        for (let i = 0; i < this.dimension; i++){
-            a += v1[i]*v2[i]
-        }
-        return a        
-    }
+    public scalar(v:Vector){}
 }
 

[NoCoverage] ConditionalExpression
src/plan.ts:45:13
     }
 
     public scalar(v:Vector){
-        if (v.dimension !== this.dimension){
+        if (true){
             throw new Error("Vectors dimension need to be the same")
         }

[NoCoverage] BlockStatement
src/plan.ts:45:44
     }
 
     public scalar(v:Vector){
-        if (v.dimension !== this.dimension){
-            throw new Error("Vectors dimension need to be the same")
-        }
+        if (v.dimension !== this.dimension){}
 
         let v1 = this.vector

[NoCoverage] StringLiteral
src/plan.ts:46:29
 
     public scalar(v:Vector){
         if (v.dimension !== this.dimension){
-            throw new Error("Vectors dimension need to be the same")
+            throw new Error("")
         }
 

[NoCoverage] UpdateOperator
src/plan.ts:53:45
         let v2 = v.vector
     
         let a:number = 0
-        for (let i = 0; i < this.dimension; i++){
+        for (let i = 0; i < this.dimension; i--){
             a += v1[i]*v2[i]
         }

[NoCoverage] BlockStatement
src/plan.ts:53:49
         let v2 = v.vector
     
         let a:number = 0
-        for (let i = 0; i < this.dimension; i++){
-            a += v1[i]*v2[i]
-        }
+        for (let i = 0; i < this.dimension; i++){}
         return a        
     }

[NoCoverage] AssignmentOperator
src/plan.ts:54:13
     
         let a:number = 0
         for (let i = 0; i < this.dimension; i++){
-            a += v1[i]*v2[i]
+            a -= v1[i] * v2[i]
         }
         return a        

[NoCoverage] ArithmeticOperator
src/plan.ts:54:18
     
         let a:number = 0
         for (let i = 0; i < this.dimension; i++){
-            a += v1[i]*v2[i]
+            a += v1[i] / v2[i]
         }
         return a        

[NoCoverage] ConditionalExpression
src/plan.ts:63:17
 export class HyperPlan extends Dimensional {
     constructor ( private points: Point[] ){
         for (let p of points){
-            if (p.dimension !== points.length){
+            if (true){
                 throw new Error("Point dimension needs to match the hyperplan dimension")
             }

[NoCoverage] ConditionalExpression
src/plan.ts:63:17
 export class HyperPlan extends Dimensional {
     constructor ( private points: Point[] ){
         for (let p of points){
-            if (p.dimension !== points.length){
+            if (false){
                 throw new Error("Point dimension needs to match the hyperplan dimension")
             }
