[Killed] BlockStatement
src/equations.ts:7:25
 export class Equation {
     constructor ( protected coefficients:Float[] ){}
 
-    retrieveY(x:number) {
-        let sum = new Float(0)
-        for (let i = 0; i < this.coefficients.length; i++){
-            let xi = new Float(x**i)
-            sum = Float.add(sum, Float.multiply(this.coefficients[i],xi))
-        }
-        return sum
-    }
+    retrieveY(x:number) {}
 
     // retrieveXFromP2(y:number){
killedBy: Eq retrieve y
statusReason: expected undefined to strictly equal Float{ numerateur: -31, …(1) }

[Killed] UpdateOperator
src/equations.ts:9:55
 
     retrieveY(x:number) {
         let sum = new Float(0)
-        for (let i = 0; i < this.coefficients.length; i++){
+        for (let i = 0; i < this.coefficients.length; i--){
             let xi = new Float(x**i)
             sum = Float.add(sum, Float.multiply(this.coefficients[i],xi))
killedBy: Eq retrieve y
statusReason: Cannot read properties of undefined (reading 'numerateur')

[Killed] ConditionalExpression
src/equations.ts:9:25
 
     retrieveY(x:number) {
         let sum = new Float(0)
-        for (let i = 0; i < this.coefficients.length; i++){
+        for (let i = 0; false; i++){
             let xi = new Float(x**i)
             sum = Float.add(sum, Float.multiply(this.coefficients[i],xi))
killedBy: Eq retrieve y
statusReason: expected { Object (numerateur, denominateur) } to strictly equal Float{ numerateur: -31, …(1) }

[Killed] BlockStatement
src/equations.ts:36:52
     //     return [x1,x2]
     // } 
 
-    public static multiply(x1:Equation,x2:Equation){
-		let n = Math.ceil( ( x1.coefficients.length * x2.coefficients.length ) / 2 ) * 2 ;
-
-		let a = new CpxTab(n)
-		let e = new CpxTab(n)
-
-        a.load(x1.coefficients)
-        e.load(x2.coefficients)
-
-		let â = fft(a);
-		let ê = fft(e);
-
-		let ô = CpxTab.multiply(â,ê);
-
-		return ifft(ô);
-    }
+    public static multiply(x1:Equation,x2:Equation){}
 
     // retrieveXFromP1(y:number){
killedBy: Eq1
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] ArithmeticOperator
src/equations.ts:37:24
     // } 
 
     public static multiply(x1:Equation,x2:Equation){
-		let n = Math.ceil( ( x1.coefficients.length * x2.coefficients.length ) / 2 ) * 2 ;
+		let n = Math.ceil( ( x1.coefficients.length / x2.coefficients.length ) / 2 ) * 2 ;
 
 		let a = new CpxTab(n)
killedBy: Eq2
statusReason: expected '[ -4 1 ]' to strictly equal '[ -6 1 2 0 ]'

[Killed] ArithmeticOperator
src/equations.ts:37:22
     // } 
 
     public static multiply(x1:Equation,x2:Equation){
-		let n = Math.ceil( ( x1.coefficients.length * x2.coefficients.length ) / 2 ) * 2 ;
+		let n = Math.ceil( x1.coefficients.length * x2.coefficients.length * 2 ) * 2 ;
 
 		let a = new CpxTab(n)
killedBy: Eq1
statusReason: expected '[ -6 0 0 0 ]' to strictly equal '[ -6 0 ]'
